[{"number":"0","filename":"Acharei Mot 1b.mp3","title":"Acharei Mot 1b","description":"Chp. 16 verse 16 - chp. 18 verse 5: Continues with the service of the High Priest on Yom Kippur. Chp. 17, the prohibition of sacrificing an animal outside the Tabernacle or Temple. Next the prohibitions of eating blood, unclean, or torn(trief) animals. Chp. 18, Hashem commands them not to go in the way of the Egyptians, or Cannanim. To guard His statutes and to go in His ways.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Acharei","id":"1"},{"number":"0","filename":"Vayishlach 3b.mp3","title":"Vayishlach 3b","description":"Chp. 35 verse 20 - end of chp. 36: : Yaakov buries Rachel on the road to Beth Lechem and puts a marker on her grave. Ruevain has relations with Bilhah. Yitzhok dies at the age of 180. Chp 36 tells us about the genealogy of Esau's family. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayishlach","id":"2"},{"number":"0","filename":"Ki Tavo 1b.mp3","title":"Ki Tavo 1b","description":"Chp. 26 verse 15 - Chp. 27 verse 26: Continues with the laws of tithing. Command to serve and obey Hashem and you will be his own treasure. Chp. 27, command when they would cross the Jordon to erect large stones and clearly write on them the words of the Torah. Then to build an alter of stones and to sacrifice burnt offerings and peace offerings on it. Which were to be eaten in a state of rejoicing. They were then to accept the laws of the Torah by six tribes standing on Mt. Gerizim, representing the blessings and six tribes standing on Mt. Eival signifying the curses. The levites were to stand in the valley between the mountains and pronounce the blessings and the curses.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Tavo","id":"3"},{"number":"0","filename":"Bereishit NC1.mp3","title":"Bereishit NC1","description":"Introduction to the portion of Bereishis","ultime":"2012-08-28","dir":"mp3\/NC\/","parashah":"Bereishit","id":"4"},{"number":"1","filename":"NoachNC1 chp.6 verses 9-16 .mp3","title":"NoachNC1 chp.6 verses 9-16 ","description":"introduction to noach,and the command to build an ark","ultime":"2012-08-29","dir":"mp3\/NC\/","parashah":"Noach","id":"5"},{"number":"2","filename":"NoachNC2.MP3","title":"NoachNC2 chp 6 verse 17 - chp. 7 verse 8","description":"Hashem tells noach that He will bring a flood and destroy the world, but that He will save him and his family and to collect all the animals.","ultime":"2012-08-29","dir":"mp3\/NC\/","parashah":"Noach","id":"6"},{"number":"0","filename":"Bereishit NC2.mp3","title":"Bereishit NC2","description":"Chp. 1 verses 1 - 5: Hashem creates heaven and earth. The earth is empty and void and darkness covers the face of the water. G-d commands that there be light, and there was. He saw that the light was good, and He separated between the light and the darkness. He called the light day and to the darkness he called night. It was evening and morning one day. ","ultime":"2012-08-28","dir":"mp3\/NC\/","parashah":"Bereishit","id":"7"},{"number":"0","filename":"Bereishit NC3.mp3","title":"Bereishit NC3","description":"Chp. 1 verses 6 - 23: On the second day G-d arranged the \"rokiah\" firmament, to separate between the heavenly and earthly waters. The third day He gathered all the earthly waters allowing the dry land to be visible. On the fourth day He created the sun and the moon and all the hosts of the sky. Then on the fifth day He created all sea life and the birds. ","ultime":"2012-08-28","dir":"mp3\/NC\/","parashah":"Bereishit","id":"8"},{"number":"0","filename":"Bereishit NC4.mp3","title":"Bereishit NC4","description":"Chp. 1 verse 24 - 31: On the sixth day G-d created reptiles and animals. He then created man in His image to subdue and have dominion over everything in creation. G-d looked and saw, that everything that He made was very good and it was evening and morning of the sixth day.   ","ultime":"2012-08-28","dir":"mp3\/NC\/","parashah":"Bereishit","id":"9"},{"number":"0","filename":"Bereishit NC5.mp3","title":"Bereishit NC5","description":"Chp. 2 verses 1 - 9: On the seventh day of creation, Hashem rested from His work, and sanctified the seventh day as the Shabbos. He did not allow all plant life to grow until Adam prayed for rain. Hashem creates man and places him in the garden of Eden to live. He is told by G-d that he may eat of all the trees in the garden except the tree of life and the tree of knowledge of good and evil. ","ultime":"2012-08-28","dir":"mp3\/NC\/","parashah":"Bereishit","id":"10"},{"number":"0","filename":"Bereishit NC6.mp3","title":"Bereishit NC6","description":"Chp. 2 verses 10 - 25: begins with the four rivers that flowed from the garden. Hashem commands Adam not to eat from the tree of life and knowledge. Adam names all the animals. G-d creates a mate for Adam from his rib. He names her woman since she came from man.  ","ultime":"2012-08-28","dir":"mp3\/NC\/","parashah":"Bereishit","id":"11"},{"number":"0","filename":"Bereishit NC7.mp3","title":"Bereishit NC7","description":"Chp. 3 verses 1 - 21: We are now introduced to the serpent. He convinces her that it was good to eat from the tree of knowledge, and she also gives Adam to eat from the fruit. G-d asks Adam if he ate from the tree, he blames the woman. She blames the serpent. Hashem doesn't question the serpent He just punishes him. He then tells man and woman what their punishment would be. Adam names woman Chavah. G-d makes clothing for them.","ultime":"2012-08-28","dir":"mp3\/NC\/","parashah":"Bereishit","id":"12"},{"number":"0","filename":"Bereishit NC8.mp3","title":"Bereishit NC8","description":"Chp. 3 verse 22 - Chp. 4 verse 18: Hashem drives them out of the garden. He places a fiery angel at the entrance to guard it. Chp. 4, Chavah gives birth to Kayin and Hevel. They both bring offerings to G-d, but only Hevel's is accepted. Kayin is despondent and kills Hevel. G-d punishes him with being a wanderer for seven generations. He has a son whom he names Chanoch. ","ultime":"2012-08-28","dir":"mp3\/NC\/","parashah":"Bereishit","id":"13"},{"number":"0","filename":"Bereishit NC9.mp3","title":"Bereishit NC9","description":"Chp. 4 verse 19 - Chp. 6 verse 8: Lemech kills Kayin. Adam and Chavah give birth to a third son Sheis, as well as additional children. Mankind grows from generation to generation and their numbers increase. There are ten generations from Adam until Noach, which include two righteous individuals, Chanoch and Mesushelech. However, mankind turns evil and practiced immorality and violence. Noach however found favor in G-d's eyes. ","ultime":"2012-08-28","dir":"mp3\/NC\/","parashah":"Bereishit","id":"14"},{"number":"3","filename":"NoachNC3.mp3","title":"NoachNC3 chp.7 verse 9 - chp.8 verse 7","description":"continues with animals coming to the ark and the flood begins.","ultime":"2012-08-29","dir":"mp3\/NC\/","parashah":"Noach","id":"15"},{"number":"0","filename":"Vayelech 1b.mp3","title":"Vayelech 1b","description":"Chp. 31 verses 22 -30: Finishes off the prophecy of the future sins. So Moshe wrote the song of Ha'azinu on that day and taught it to the people. He commanded Yehoshua to be strong and that Hashem would be with him. He finished writing the words of the Torah. He then commanded the Levites to place the Torah next to the Ark so that it could be a witness against them, because he knew that they would rebel against Hashem. Then Moshe was told to assemble the people to teach them the passages of Ha'azinu, which would again remind them of the consequences of turning against Hashem. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayelech","id":"16"},{"number":"0","filename":"Vayelech 1a.mp3","title":"Vayelech 1a","description":"Chp. 31 verses 1 - 21: Introduction, Moshe tells the people that he would not be taking them into the the land but that it would be Yehoshua. He told them not to fear since Hashem would be with them as with Og and Sichon. He spoke to Yehoshua in front of all the nation and told him to be strong and courageous. He then wrote a sefer Torah and gave it to the Kohanim and the elders. He commanded that the king read from the book of Devarim at the end of every seventh year. Everyone was to attend men, women, and children. Hashem then told Moshe that he was about to die and to bring Yehoshua to the Tent. Hashem told them the sins that the nation would commit in the future. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayelech","id":"17"},{"number":"0","filename":"Shoftim 1b.mp3","title":"Shoftim 1b","description":"Chp. 17 verse 14 - Chp. 18 verse 22: Discusses the laws of a king. Chp. 18, begins with the statement that neither the Cohen nor the Levite would have a portion in the land. It goes on to specify some of the gifts which would be given to the Cohamim. That any Cohen that comes to the Sanctuary would be allowed to serve and share in the priestly portion. The Torah forbids all forms of superstition. Hashem would provide true prophets from among the people, to lead and instruct them. However, the false prophet was to be punished with death.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shoftim","id":"18"},{"number":"0","filename":"Shoftim 1a.mp3","title":"Shoftim 1a","description":"Chp. 16 verse 18 - Chp. 17 verse 14: Introduction, the command to appoint judges that would adjudicate the law to the letter. The prohibitions of planting an Asherah tree and constructing an alter made up of one stone. Chp. 17, discusses the laws of idolatry and the necessity of at least two witnesses to execute the guilty party. The command to take any religious question to the rabbinic authority of your time and to abide by their decision. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shoftim","id":"19"},{"number":"0","filename":"Shoftim 2b.mp3","title":"Shoftim 2b","description":"Chp. 20 verse 10 - Chp. 21 verse 9: Continues with laws of warfare. The command to destroy the seven nations so that you so not learn from their abominations. Chp. 21, the laws of finding a dead body in the field between two cities, known as the \"eglah arufah.\" ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shoftim","id":"20"},{"number":"0","filename":"Shoftim 2a.mp3","title":"Shoftim 2a","description":"Chp. 19 verse 1 - Chp. 20 verse 9: begins with the laws of the \"cities of refuge.\" The prohibition of moving a boundary marker. The laws of false witnesses called \" eiydem zomamin\" and their punishment. Chp. 20. The laws of going out to battle, and the promise that you will be successful.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shoftim","id":"21"},{"number":"0","filename":"Nitzavim 1b.mp3","title":"Nitzavim 1b","description":"Chp. 30 verses 1 - 20: Continuing, that Hashem would gather them from dispersion and return them to the Promised Land. Then the curse would be transferred to their enemies. They would experience blessings as long as they accepted all of Hashem's commandments. They should therefore choose life over death and good over evil and they would thrive and if not they would perish.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Nitzavim","id":"22"},{"number":"0","filename":"Ki Teitzei 1a.mp3","title":"Ki Teitzei 1a","description":"Chp. 21 verse 10 - Chp. 22 verse 1: Introduction, begins with the laws of the woman who is taken as a captive in battle.Continues with the laws of inheritance of the first born even if his mother is not loved by his father. Then the laws of the rebellious son. The command to not leave a body hanging over night, after one had been executed by the court. Chp. 22 begins with the laws of returning the lost ox or sheep of your brother. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Teitzei","id":"23"},{"number":"0","filename":"Yitro 3b.mp3","title":"Yitro 3b","description":"Chp. 20 verses 21-23: Sedra concludes with the earthen alter, sacrifices, stone alter, and the ramp. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Yitro","id":"24"},{"number":"0","filename":"Ki Teitzei 2b.mp3","title":"Ki Teitzei 2b","description":"Chp.24 verse 17 - Chp. 25 verse 19: Not to pervert justice against the poor. Laws of forgotten sheaves and corner of the field, The gleanings of a vineyard. Chp. 25, laws concerning assault and battery. The punishment of lashes. Prohibition of muzzling your ox. The laws of the levirite marriage. Laws of weights and measures, and a warning to businessman to be honest. A warning to remember what Amalek did and to wipe out their memory.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Teitzei","id":"25"},{"number":"0","filename":"Ki Teitzei 2a.mp3","title":"Ki Teitzei 2a","description":"Chp. 23 verse 1 - Chp. 24 verse 17: The prohibition of marrying your father's wife. Those who are prohibited to become converts. The laws of accepting the Edomite and the Egyptian as a convert. Laws concerning a soldier maintaining the sanctity of the Jewish camp. The laws of a runaway slave. The prohibition of prostitution. Laws of taking interest. Whoever makes a vow must fulfill it. The laws of a hired worker. Chp. 24, the laws of divorce. Laws of marriage. Laws of lending money to a Jew and taking security. Prohibition of kidnapping. Reminder about leprosy. More laws about loaning money. Laws about employees. One cannot testify for a father nor a father for a son.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Teitzei","id":"26"},{"number":"0","filename":"Vayishlach 3a.mp3","title":"Vayishlach 3a","description":"Chp.34 verse 15 - Chp. 35 verse 20: The brothers devise a plan to have the Schechemites' circumcise themselves. They agree and on the 3rd day Shimon and Levi kill all the men in the city and save Dinah. Yaakov and family leave Schechem and comes to Luz and he builds an alter to Hashem. Hashem changes his name to Israel. Rachel gives birth to Binyamin and dies in childbirth. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayishlach","id":"27"},{"number":"0","filename":"Ki Teitzei 1b.mp3","title":"Ki Teitzei 1b","description":"Chp. 22 verses 1 - 29: Continues with the laws of returning anything that someone has lost. The law of helping with the loading of an animal. Prohibition of cross dressing. Sending away the mother bird. The requirement to build a fence around your roof. The laws of forbidden mixtures. The command to put Tzitzitts on your garments. The laws of a man who falsely accuses his bride of not being a virgin. The law if his claim is correct. The laws of adultery. The laws of raping a woman who is betrothed. The laws of a man who seduces a virgin. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Teitzei","id":"28"},{"number":"0","filename":"Ki Tavo 2b.mp3","title":"Ki Tavo 2b","description":"Chp. 28 verse 47 - Chp. 29 verse 8: Continues with the curses that would befall the people for their disobedience to Hashem and His Torah. Chp. 29, Moshe began his third and final discourse to the people. He appealed to them to remember Hashem their G-d who watched over them in Egypt, during their wanderings in the wilderness and who would continue to protect them in the future.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Tavo","id":"29"},{"number":"0","filename":"Ki Tavo 2a.mp3","title":"Ki Tavo 2a","description":"Chp. 28 verses 1 - 47: Moshe tells the people all the blessings they will receive if they keep G-d's Torah. Then he enumerates all the curses that will befall them if they rebel against Hashem and His Torah. All their difficulties will occur because \" You did not serve the L-rd your G-d with joyfulness and with gladness of heart, by reason of the abundance of all things.\" ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Tavo","id":"30"},{"number":"0","filename":"Nitzavim 1a.mp3","title":"Nitzavim 1a","description":"Chp. 29 verse 9 - Chp. 30 verse 1: Introduction, on the day that Moshe was to die, he gathered all the nation together. He confirmed the Covenant not only for them but for all future generations. He again warned them of the consequences they would experience if they did not follow the ways of Hashem. Chp. 30, Moshe begins to tell them what will happen after they have experienced Hahem's blessings and curses. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Nitzavim","id":"31"},{"number":"0","filename":"Ha'azinu 1b.mp3","title":"Ha'azinu 1b","description":"Chp. 32 verses 17 - 52: He continues with his message. That in later generations they may turn to other objects to worship. Consequently, Hashem will repay their lack of appreciation with the denial of His favor. His punishments will be disease and the cruelty of the enemy. His only concern will be that the enemy should not gloat which will prevent the complete annihilation of the nation. Israel should then realize that their survival is totally dependent upon Hashem and their obedience. After completing this address Moshe was told to ascend Mount Nevo so that he would be able to see the Promised Land before he died.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ha'azinu","id":"32"},{"number":"0","filename":"Eikev 2b.mp3","title":"Eikev 2b","description":"Chp. 11 verses 17 - 25: Continues with the second paragraph of the \"Shema.\" He assures them that if they go in the ways of Hashem and cling to Him, that G-d would drive out the nations before them and that everyone would fear them. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Eikev","id":"33"},{"number":"0","filename":"Eikev 2a.mp3","title":"Eikev 2a","description":"Chp. 10 verse 8 - Chp. 11 verse 17: He then tells them about Hashem separating the tribe of Levi to serve Him and that they would have no portion in the land. He said, what G-d wants is that you fear, love, and serve Him with all your heart and soul, by keeping all of His commandments. Chp. 11, Moshe reviews the many miracles and deliverance's that they had experienced on their journey. He assures them that the land that they were about to enter was one that Hashem had His eyes on from the beginning of the year to the end of the year. It continues with the second paragraph of the \"Shema.\" ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Eikev","id":"34"},{"number":"0","filename":"Eikev 1b.mp3","title":"Eikev 1b","description":"Chp. 8 verse 9 - Chp. 10 verse 7: He assures them that they will eat and be sated. However, he warns them that ingratitude would be severely punished, and they would share the fate of the previous nations. Chp. 9, he reminds them of their earlier acts of rebellion. That is was only because of his intervention that they were saved. Chp. 10, he reminds them that Hashem then commanded him to hew out a second set of tablets, so that Hashem could write the commandments on them. He then mentions the death of Aaron and that Elazar his son took his place. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Eikev","id":"35"},{"number":"0","filename":"Eikev 1a.mp3","title":"Eikev 1a","description":"Chp. 7 verse 12 - Chp. 8 verse 8: Introduction, Moshe continues his address to the nation and assures them of prosperity and good health if they follow Hashem's commandments. They need not fear the Canaanites as long as they destroy all forms of idolatry. Chp. 8, he tells them that the forty years in the desert were to teach them the discipline necessary to serve Hashem. For them to learn that \"man does not live by bread alone, but by everything that proceeds from the mouth of Hashem.\" He then goes on to describe the seven species for which Israel is praised for.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Eikev","id":"36"},{"number":"0","filename":"Devarim 2.mp3","title":"Devarim 2","description":"Chp. 2 verse 17 - Chp. 3 verse 22: (21:10) Continues with Chp. 3 verse 23 - Chp. 4 verse 2 beginning the sedra of Va'etchanan: Moshe continues to recall the travels, battles, and events that the nation experienced on their journey to the promised land. (21:10) begins with the introduction to the sedra of Va'etchanan, Moshe tells of his impassioned plea to Hashem to allow him to enter the land. G-d refuses, but does allow him to see the land. He commands Moshe to encourage Yehoshua in his position of leading the nation in their acquisition of the land. Chp. 4, Moshe then ocmmands the poeple to listen to the laws that he would teach them so that they would be able to live and possess the land of their fathers.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Devarim","id":"37"},{"number":"0","filename":"Devarim 1b.mp3","title":"Devarim 1b","description":"Chp. 1 verse 15 - Chp. 2 verse 17: Continues with Moshe recounting his appointment of judges. He recalled the incident with the spies, and Hashem's punishment for that generation,to wander in the desert for forty years. Chp. 2 begins with Moshe telling them that to travel from Mount Seir, but not to contend with the descendants of Esua. Moshe recounted other travels for them. He then said to them that all the men of that generation died as Hashem had sworn. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Devarim","id":"38"},{"number":"0","filename":"Vayishlach 2b.mp3","title":"Vayishlach 2b","description":"Chp. 32 verse 31 - Chp. 34 verse 14: Yaakov and Esau meet and they kiss and weep. Yaakov introduces his family to Esau. Esau offers to travel with Yaakov but he declines the offer, they separate peacefully. Yaakov goes to Schechem where he buys a parcel of land. Chp. 34 begins the story of the rape of Dinah and the beginning of the discussion between the brothers and her rapist, Schechem.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayishlach","id":"39"},{"number":"0","filename":"Vayishlach 2a.mp3","title":"Vayishlach 2a","description":"Chp. 32 verse 19-31: Yaakov instructs the messengers what to say to Esau when they present him with the gifts. He has a fight with Esau's angel who injures him in his thigh, but Yaakov is victorious. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayishlach","id":"40"},{"number":"0","filename":"Vayishlach 1b.mp3","title":"Vayishlach 1b","description":"Chp. 32 verse 9-18: Yaakov prays to Hashem for help. He then sends gifts to Esau. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayishlach","id":"41"},{"number":"0","filename":"Vayishlach 1a.mp3","title":"Vayishlach 1a","description":"Chp. 33 verse 4-9: Yaakov now on his way back to Canaan, sends messengers to his brother Esua with gifts, hoping to avoid a battle with his brother. Esau is coming to meet him with 400 men. Yaakov is afraid and distressed and he divides his family and possessions into two camps in the hope that one will survive.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayishlach","id":"42"},{"number":"0","filename":"Vayigash 2b.mp3","title":"Vayigash 2b","description":"Chp. 47 verses 6 - 27: Pharaoh offers the family the land of Goshen. Yosef introduces him to Yaakov and he blesses him. Yosef supports his family during the famine. The people sell themselves and their land to Pharaoh so that they don't die. Israel lived in the land of Goshen and they were fruitful and multiplied greatly.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayigash","id":"43"},{"number":"0","filename":"Vayigash 2a.mp3","title":"Vayigash 2a","description":"Chp. 46 verse 8 - Chp. 47 verse 6: Names the people who came down to Egypt with Yaakov. Yosef goes out to greet his father. He coaches his brothers on what to say when they meet Pharaoh. Chp. 47, Pharaoh is introduces to five of the brothers. They tell him what Yosef had told them to say. \r\n\r\n\r\n\r\n\r\n","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayigash","id":"44"},{"number":"0","filename":"Vayigash 1b.mp3","title":"Vayigash 1b","description":"Chp. 45 verse 16 - chp. 46 verse 8: Pharaoh and the people are pleased that Yosefs brothers have come to Eygpt. Pharaoh sends wagons to transport the family and their possessions. Chp. 46, Yaakov stops in Beer Sheva were he offers sacrifices to Hashem. Hashem promises to make him a great nation in Egypt. He tells that He will go down to Egypt with him and that He will also bring Yaakov back, and that Yosef will be the one to close his eyes when he dies. Yaakov leaves Canaan with all of his family. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayigash","id":"45"},{"number":"0","filename":"Vayigash 1a.mp3","title":"Vayigash 1a","description":"Chp. 44 verse 18 - chp. 45 verse 16: Yehudah approaches the viceroy with an impassioned plea to save Binyamin from servitude in Egypt. In chp.45 Yosef can no longer restrain himself from revealing himself to his brothers. He tells them to tell his father that he is alive and a ruler in Eygpt and that he should bring all the family and their possessions to Egypt. He cries on the shoulder of Binyamin and all the his brothers.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayigash","id":"46"},{"number":"0","filename":"Vayeitzei 3b .mp3","title":"Vayeitzei 3b ","description":"Chp. 32 verse 1 until end of sedra.  Lavan's relationship with Yaakov begins to deteriorate. Hashem tells Yaakov to return to his land. He confers with his wives and they agree. Yaakov leaves and Lavan chases after him. Hashem appears to Lavan in a dream and tells him not speak to Yaakov \"neither good nor bad.\" Lavan searches the camp of Yaakov for his \"terafim\" and doesn't find them even though Rachel had taken them. Yaakov expresses his anger at being accused of theft after he had treated Lavan so well. They make a treaty and they both go their own ways.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeitzei","id":"47"},{"number":"0","filename":"Vayeitzei 3a.mp3","title":"Vayeitzei 3a","description":"Chp. 30 verse 14 - chp. 31 verse 1.  Reuvain gives his mother mandrakes which Rachel wants. Leah than gives birth to two more sons and one daughter. Rachel finally gives birth to Yosef. Yaakov makes a business deal with Lavan concerning the sheep which Lavan tries to change many times, but Yaakov with the help of Hashem manages to still become exceedingly wealthy. Chp. 31 begins with Lavan's jealously about Yaakov'a new found wealth.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeitzei","id":"48"},{"number":"0","filename":"Vayeitzei 2b.mp3","title":"Vayeitzei 2b","description":"Chp. 29 verse 17 - chp. 30 verse 13.  Continues with description of Rachel and Leah and that Yaakov agrees to work for 7 years to marry Rachel. Lavan tricks him and gives him Leah instead, he complains. Lavan gives him Rachel but for another 7 years work. Hashem sees Leah's pain and gives her four sons. Chp. 30 begins with Rachel complaint to Yaakov that she has no children. She gives him Bilah as a wife and she bears him two sons. Leah then does the same with Zilpah and she also bears two more sons to Yaakov.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeitzei","id":"49"},{"number":"0","filename":"Vayeitzei 2a.mp3","title":"Vayeitzei 2a","description":"Chp. 28 verse 20 - chp. 29 verse 17.  Yaakov makes a vow to tithe everything he owns if Hashem will take care of his needs. He comes to the well in Haran where he meets Rachel introduces himself and waters her sheep. He meets uncle Lavan and he goes to work for him tending his sheep. Ends with a description of Leah and Rachel. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeitzei","id":"50"},{"number":"0","filename":"Vayeitzei 1a.mp3","title":"Vayeitzei 1a","description":"Chp. 28 verse 11 - chp. 28 verse 19.  Yaakov spends the night at the site of the temple and he has a dream about a ladder. Hashem then blesses him and his descendants and promises to protect him. He comes to realize that the place was the gateway to heaven and he calls it Bais-el.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeitzei","id":"51"},{"number":"0","filename":"Vayeishev 3a.mp3","title":"Vayeishev 3a","description":"Chp. 39 verse 7 - Chp. 40 verse 23: Potifars' wife tries to seduce Yosef, but he refuses. She accuses him of rape and he is thrown in the royal dungeon. There he meets the Chief Baker and Chief Butler. They both have a dream which Yosef interprets correctly. The Baker dies and the Butler lives. Yosef asks the Butler to remember him to Pharaoh. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeishev","id":"52"},{"number":"0","filename":"Vayeishev 2b.mp3","title":"Vayeishev 2b","description":"Chp. 38 verse 8 - chp, 39 verse 6: Continues with Onan marrying his brothers widow and he too dies for his sins. Yehudah tells his daughter in law to wait for his third son to mature so that he can marry her, but she sees that Yehudah has no intention of doing so. And so Yehudah's wife dies and Tamar dresses up as a harlot and seduces her father in law without him realizing who she was. She becomes pregnant from that relationship and Yehudah wants her killed for infidelity but then he realizes that he is the father. She gives birth to twins. Chp. 39, begins with Yosef being sold to Potifar, a minister in Pharaoh's court. Hashem blesses Yosef in all that he does in the house of his new master. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeishev","id":"53"},{"number":"0","filename":"Vayeishev 2a.mp3","title":"Vayeishev 2a","description":"Chp. 37 verse 23 - Chp. 38 verse 8: The brothers strip Yosef of his coat of many colors, they throw him in a pit, and then they sit down to eat. They then sell him to the Ishmaelites who sell him in Egypt. They dip his coat in sheeps blood and show it to their father, who mourns for the loss of his favorite son. Chp. 38, begins the story of Yehudah marrying and fathering three sons. The eldest son, Er marries Tamar but he sins and dies. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeishev","id":"54"},{"number":"0","filename":"Vayeishev 1b.mp3","title":"Vayeishev 1b","description":"Chp. 37 verse 9-22: Continues with the dreams of Yosef. Yaakov sends him out to the field to check on the brothers and the sheep. The brothers see him and plan to kill him but Ruevain convinces them to throw him in a pit instead, so that he can later save him.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeishev","id":"55"},{"number":"0","filename":"Vayeishev 1a.mp3","title":"Vayeishev 1a","description":"Chp. 37 verse 1-8: Begins with the story of Yosef and his dreams. He tells them to his brothers and they hate him. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeishev","id":"56"},{"number":"0","filename":"Vayeira3b chp 22 - until end of sedra.mp3","title":"Vayeira3b chp 22 - until end of sedra","description":"This chapter deals with the \"Akeidah\" the binding of yitzhok, and ends with the birth of rivkah.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeira","id":"57"},{"number":"0","filename":"Vayeira2b chp. 19 verse 33 - until end chp. 21 .mp3","title":"Vayeira2b chp. 19 verse 33 - until end chp. 21 ","description":"Lot gets drunk and is seduced by his two daughters. Avraham travels to gerar where the king abducts sawra. Hashem appears to the king in a dream and tells him that he is going to die for taking sawra. Avrahem prays for the king and his household. Avimelech then invites him to reside in his country and showers him with gifts. Sawra gives birth to yitzhok. Avraham is tested by Hashem by driving hagar and yishmael from his house. Angel appear to hagar. The king visits avraham and makes a treaty with him. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeira","id":"58"},{"number":"0","filename":"Vayeira2a chp. 18 verse 24 - chp. 19 verse 33.mp3","title":"Vayeira2a chp. 18 verse 24 - chp. 19 verse 33","description":"Avraham continues his passionate plea for the people of sodom. The angels come to sodom and lot invites them to come to his house and offers them food and lodging. The people of sodom surround the house and demand that lot give them his guests. Angels tell lot of their mission to destoy the city and tell him to take his family and possessions and they will escort him out of the city before they destoy it. They are told not to look back at the destruction but lot's wife does and is turned into a pillar of salt. We begin the story of lot and his two daughters.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeira","id":"59"},{"number":"0","filename":"Vayeira1b chp. 18 verse 5 - chp. 18 verse 24.mp3","title":"Vayeira1b chp. 18 verse 5 - chp. 18 verse 24","description":"continues with avraham's hospitality for his three guests. They bless him that sawra should bear a son in one years time, she laughs. Two of the angels go on to sodom to destroy it and to save lot. Hashem informs Avraham of His plans to destroy sodom and avraham begins his plea to save the cities.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeira","id":"60"},{"number":"0","filename":"Vayeira1a chp. 18 verse 1 - verse 5.mp3","title":"Vayeira1a chp. 18 verse 1 - verse 5","description":"Hashem appears to avraham on the 3rd day after his circumcision. During the visit three men\/angels appear and Avraham shows them great hospitality.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayeira","id":"61"},{"number":"0","filename":"Vayechi 3b.mp3","title":"Vayechi 3b","description":"Chp. 50 verse 20 until the end of sedra: Yosef assures the brothers that just like they were not able to inflict any true harm on him so too he would not be able to inflict any harm on them. Yosef lived to see three generations and was the first of the brothers to die at the age of 110. He was embalmed and they put him in a coffin in Egypt. End of the Book of Bereishit. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayechi","id":"62"},{"number":"0","filename":"Vayechi 3a.mp3","title":"Vayechi 3a","description":"Chp. 49 verse 27 - Chp. 50 verse 20: Concludes with the blessings to Binyamin and the command to bury him in the Machpelah, and then he dies. Chp. 50, deals with the embalming of Yaakov's body and Yosef and his brothers taking their father to Canaan with a military escort. All the kings come out to show their respect and he is buried. They return to Egypt, the brothers perceive a change in Yosefs' attitude towards them, but he denies it and assures them that he will continue to support them and their families. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayechi","id":"63"},{"number":"0","filename":"Vayechi 2b.mp3","title":"Vayechi 2b","description":"Chp. 49 verses 15 - 26: Continues with the blessings of Yisaachor, Dan, Gad, Ashur, Naftali, and Yosef.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayechi","id":"64"},{"number":"0","filename":"Vayechi 2a.mp3","title":"Vayechi 2a","description":"Chp. 49 verses 1 - 15: Yaakov gathers his sons around his deathbed before he dies. He tries to tell them when the Messiah will come but the \"Schechinah\" (Divinity of G-d) leaves him. He begins to Bless his sons starting with the eldest Ruevain, then Shimon and Levi. Next Yehudah, Zevulun and Yisaaachor. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayechi","id":"65"},{"number":"0","filename":"Vayechi 1b.mp3","title":"Vayechi 1b","description":"Chp. 48 verse 7 until end of chp: Yaakov blesses his two grandsons. There is some confusion about the order. Gives them the blessing that is still used today to bless our sons. Yaakov gives Yosef Schechem as an inheritance over and above that which the other brothers' would inherit. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayechi","id":"66"},{"number":"0","filename":"Vayechi 1a.mp3","title":"Vayechi 1a","description":"Chp. 47 verse 28 - chp. 48 verse 7: Yaakov lives in Egypt for seventeen years. When he is close to death he calls Yosef, and asks him to swear that he will bury him in the land of Canaan, and Yosef swears. Chp. 48, Yosef is told that his father is on his deathbed and so he takes his two sons with him to receive their last blessing from Yaakov. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayechi","id":"67"},{"number":"0","filename":"Toldot 3 .mp3","title":"Toldot 3 ","description":"Chp 27 verse 40 until the end of sedra. Esau hates Yaakov for taking his blessing and plans to kill him. Knowing this, Rivkah sends Yaakov to her brother Lavan. Chapter 28 begins with Yitzhok blessing Yaakov with Avraham's blessing and telling him to marry a daughter from the children of Lavan. Esau takes another wife from the daughters of Yishmael.                           Last 18 minutes of lecture chp 28 verses 10-11 begin sedra of Vayeitzei:  Vayeitzei begins with an introduction and Yaakov leaving Beer-sheva and coming to the place of the temple.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Toldot","id":"68"},{"number":"0","filename":"Toldot 2b .mp3","title":"Toldot 2b ","description":"Chp 27 verse 6 - chp 27 verse40: Rivkah tells Yaakov to dress as Esau and take his blessing, he is reluctant but she insists. Yitzhok, though not certain about his identity blesses Yaakov anyway with Esaus' blessing. Esau returns from the field and is distraught when he realizes that Yaakov took his blessing. Yaakov does manage to give Esau a blessing as well. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Toldot","id":"69"},{"number":"0","filename":"Toldot 2a.mp3","title":"Toldot 2a","description":"Chp 26 verse 1 - chp 27 verse 5: There is a famine in the land and Yitzhok moves his family to Gerar. Hashem blesses him with the blessing that He had given to Avraham. He tells Rivkah to say that she is his sister. He is very successful and re-opens the wells that his father dug. Avimelech visits and makes a treaty with him. Esau gets married. Chapter 27 begins with Yitzhok telling Esau that he wants to bless him before he dies. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Toldot","id":"70"},{"number":"0","filename":"Toldot 1b.mp3","title":"Toldot 1b","description":"Chp 25 verse 25 - end of chp 25: Continues with the birth of Yaakov, a description of who the brothers were, and that Yitzhok loved Esau and Rivkah loved Yaakov. Esau sells his birthright to Yaakov for a bowl of lentils. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Toldot","id":"71"},{"number":"0","filename":"Toldot 1a.mp3","title":"Toldot 1a","description":"Chp 25 verse 19 - chp 25 verse 25: This sedra deals with Yitzhok and his children Esau and Yaakov. It begins by telling us that Yaakov married Rivkah and that she was barren. He prays and she becomes pregnant, but her pregnancy is difficult and unusual, and she is told that she is carrying twins who will be antagonist all their lives. The first one born is hairy and they call him Esau.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Toldot","id":"72"},{"number":"0","filename":"Noach 2b.mp3","title":"Noach 2b","description":"Chp. 9 verse 23 - Chp. 11 verse 32: Shem and Japheth cover their father's nakedness. When he wakes and realizes what his youngest son had done he curses his grandson Canaan. He then blesses Shem and Japheth. Chp. 10, the Torah traces the genealogy of Japheth, Ham, and then Shem. Chp. 11, the Torah continues with the story of the tower of Babel. This would lead to the dispersion of mankind upon the face of the whole earth and creation of different nations and languages. There were ten generations from Noach till Avrom. He lived in Uhr Kasdim and it was there that he realized the oneness of Hashem. In Kasdim, Nimrod threw him into the fiery furnace because of his refusal to serve idols, and his decision to serve the only true G-d. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Noach","id":"73"},{"number":"0","filename":"Noach 2a.mp3","title":"Noach 2a","description":"Chp. 8 verse 10 - Chp. 9 verse 22: Noach sends the dove out 7 days later and she returns with an olive leaf in its beak indicating that the waters had receded. The third time he sends the dove it does not return. G-d tells Noach to leave the ark with his family and all the animals. He builds an alter and brings offerings to Hashem who promises him that he will not repeat what he had done to the earth again and that things will return back to normal. Chp. 9, Hashem blesses Noach and his sons that they should replenish the earth. He assures them that the dread of them would be upon all living things. He permits them to eat meat, but not blood. He shows Noach the rainbow as a sign that he would not longer destroy all of mankind again. Noach gets drunk in his tent, and Ham sees the nakedness of his father and tells his two brothers. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Noach","id":"74"},{"number":"0","filename":"Noach 1b.mp3","title":"Noach 1b","description":"Chp. 6 verse 16 - Chp. 8 verse 10: Hashem tells Noach that he will destroy the earth and continue mankind through him. He was to enter the ark together with his family. Also a male and female of all animals, birds, and everything that creeps on the earth, in addition to food. Chp. 7, Noach is also commanded to bring seven pairs of all kosher animals and birds. The rain began on the 17th of the second month, and continues for 40 days and nights. The waters lasted for 150 days. Chp. 8, the ark rested on the mountains of Ararat in the 7th month on the 17th day of the month. After almost 3 months he sent a raven to see whether the dry land had reappeared. It just flew back and forth. Then he sent a dove but it did not find any dry land and it returned. Seven days later he sent it out again.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Noach","id":"75"},{"number":"0","filename":"Noach 1a.mp3","title":"Noach 1a","description":"Chp.6 verses 9 -16: Introduction, Torah praises Noach. He has three sons. Hashem sees that mankind has filled the earth with corruption and violence. He tells Noach that He intends to destroy the earth. He commands him to build an ark built to His specifications.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Noach","id":"76"},{"number":"0","filename":"Mikeitz 3b.mp3","title":"Mikeitz 3b","description":"Chp. 43 verse 34 - chp. 44 verse 17: After the meal Yosef has the sacks of the brothers filled with grain and in the sack of Binyamin he hides his silver goblet. After they leave he has his servant chase after them and accuse them of stealing his goblet. They search and find the goblet in Binyamins' sack, they all return to the viceroy who chastises them and says that he will keep Binyamin as a slave and that they can leave in peace. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Mikeitz","id":"77"},{"number":"0","filename":"Mikeitz 3a.mp3","title":"Mikeitz 3a","description":"Chp. 43 verse 1-34: The famine continues and Yaakov is forced to send Binyamin to Egypt based on a guarantee from Yehudah. Yosef invites them to his house to eat and he sees his brother Binyamin. They all sit down to a meal and he gives them gifts and they drink with him.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Mikeitz","id":"78"},{"number":"0","filename":"Mikeitz 2b.mp3","title":"Mikeitz 2b","description":"Chp. 42 verse 8 - end of Chp.: Yosef recognizes his brothers but they do not recognize him. He accuses them of being spies. They tell him about their father and younger brother who are in Canaan. He puts Shimon in jail and sends the rest of them home with provisions. He tell them not to return unless they bring back Benyamin. They find the money in their sacks and are concerned. They tell Yaakov about all that had happened but he refuses to send Binyamin back to Egypt. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Mikeitz","id":"79"},{"number":"0","filename":"Mikeitz 2a.mp3","title":"Mikeitz 2a","description":"Chp. 41 verse 39 - Chp. 42 verse 8: Pharaoh appoints Yosef viceroy, with complete autonomy. He gives him a new name and a new wife. She bears him two sons. There are seven years of plenty and then begin the seven years of famine, as Yosef had prophesied. Chp. 42, begins with Yaakov sending ten brothers to Egypt to buy grain. They meet the viceroy and they bow down to him, he recognizes them but does not reveal his identity to them.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Mikeitz","id":"80"},{"number":"0","filename":"Mikeitz 1a.mp3","title":"Mikeitz 1a","description":"Chp. 40 verse 23 - Chp. 41 verse 38: After two years, Pharaoh has two dreams that no one can interpret, and now the Butler remembers Yosef to Pharaoh. He is taken from prison interprets the dreams and gives Pharaoh advice as to how best to survive the upcoming famine. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Mikeitz","id":"81"},{"number":"0","filename":"Lech Lecha2b.mp3","title":"Lech Lecha2b chp. 16 verse 2 until end of sedra","description":"Hagar concieves but difficulties arise between her and sawri. Hagar runs away and she meets an angel who ask her why she has left. he tells her to return and promises her that her son will be a great nation. the birth of yishmael. Hashem tells avram to circumcise himself. Hashem changes his name to avraham and his wifes name to sawra and promises him a son from sawra. he then circumcises yishmael and all the male members of his household.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Lech Lecha","id":"82"},{"number":"0","filename":"Lech Lecha2a.mp3","title":"Lech Lecha2a chp. 14 verse 18 chp. 16 verse 2","description":"Avram meets with malchizedek king of salem(shem). He returns all the captives to the king of sodom, but refuses to take any of the booty. Hashem then promises to protect avram and to give him many descendants. hashem then makes a covenant with him and tells him that his children will be enslaved and also redeemed. Sawra then gives her maidservant hagar to avram to bear him a child.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Lech Lecha","id":"83"},{"number":"0","filename":"Lech Lecha1b.mp3","title":"Lech Lecha1b chp. 12 verse 13 - chp. 14 verse 17","description":"sawra is abducted and taken to the harem of pharoh. Hashem punishes pharoh and he releases her and gives abram many gifts and escorts them out of egypt.Lot and abram part ways, lot goes to sodom. then Hashem appears to abram and promises him the land and children. the war between the 4 kings and the 5 kings. lot is taken captive abram goes to war against the 4 kings to save lot and he is victorious","ultime":"2012-08-01","dir":"mp3\/","parashah":"Lech Lecha","id":"84"},{"number":"0","filename":"Lech Lecha1a.mp3","title":"Lech Lecha1a chp.12 verse 1 - verse 13","description":"Abram at the age of 75 leaves haran with his wife and his nephew to the place that Hashem would show him.He stops in the land of cannaan and Hashem appears to him and he builds an alter to thank Hashem. There is a famine in the land and so he goes to egypt. He tells his wife to say that she is his sister to protect his life.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Lech Lecha","id":"85"},{"number":"0","filename":"Chayei Sarah 2b.mp3","title":"Chayei Sarah 2b","description":"Chp. 25 verse 6 until end: Avraham gives his sons from Keturah gifts and he sends them to the east. He dies and is buried by Yitzhok and Yishmael. The Torah then lists the children of Yishmael and then recounts his death.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Chayei Sarah","id":"86"},{"number":"0","filename":"Chayei Sarah 2a.mp3","title":"Chayei Sarah 2a","description":"Chp.24 verse 23 - chp. 25 verse 5: Rivkah takes Eliezer to her father's house, and we meet her brother Lavan. Eliezer retells the story of how he met Rivkah to her family and the family agrees to allow her to go with him to marry Yitzhok. Yitzhok goes out to the field to pray and she sees him. Chp. 25 begins with Avraham taking Keturah as a wife, and the names of the children she bore for him are recounted.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Chayei Sarah","id":"87"},{"number":"0","filename":"Chayei Sarah 1b.mp3","title":"Chayei Sarah 1b","description":"Chp. 24 verse 1 - chp. 24 verse 23: Avraham is now old and he sends his trusted servant Eliezer to find a wife for Yitzhok from his family in Aram Naharaim. He finds Rivkah at the well and she gives him and his camels water to drink. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Chayei Sarah","id":"88"},{"number":"0","filename":"Chayei Sarah 1a.mp3","title":"Chayei Sarah 1a","description":"Chp. 23 - chp. 24 verse 1:  The death and burial of Sarah.  Avraham purchases the cave of the Machpela from Efrom.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Chayei Sarah","id":"89"},{"number":"0","filename":"Bereishit 3b.mp3","title":"Bereishit 3b","description":"Chp. 4 verse 5 - Chp. 6 verse 8: Hashem did not accept Kayin's offering and he was upset. Kayin kills his brother and Hashem condemns him to wander for seven generations until he will die. Lemech kills Kayin. Adam reconciles with Chavah and she gives birth to Sheis. Mankind continues to increase. There are ten generations form Adam to Noach, which included two righteous individuals, Chanoch and Mesushelech. However, most of mankind practiced immorality and violence. Hashem questioned His decision to create mankind, however Noach found favor in His eyes.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bereishit","id":"90"},{"number":"0","filename":"Bereishit 3a.mp3","title":"Bereishit 3a","description":"Chp. 3 verse 7 - Chp. 4 verse 4: She eats from the tree and gets Adam to do the same. They hear G-d's presence and they hide. G-d asks Adam why he ate from the tree and he blames Chavah. She blames the snake. G-d punishes the snake. He tells Chavah what her punishment will be. Then He informs Adam of his punishment. Adam and Chavah are then banished from the garden and G-d places a fiery angel to guard the entrance. Chp. 4, They have two children, Kayin and Hevel. Kayin becomes a farmer and Hevel a shepard. Both bring sacrifices to Hashem and He accepts Hevel's offering. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bereishit","id":"91"},{"number":"0","filename":"Bereishit 2b.mp3","title":"Bereishit 2b","description":"Chp. 2 verse 5 - Chp. 3 verse 6: Hashem waters the earth so that vegetation can grow. He creates man and places him in the garden to work it and to guard it. He warns man not to eat from the tree of knowledge, least he die. Adam names all the animals. Hashem takes a rib from man and He creates woman. Adam names her woman since she was taken from man. Chp. 2, we are introduces to the snake, who begins a conversation with Chavah trying to convince her that she should eat from the tree of knowledge. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bereishit","id":"92"},{"number":"0","filename":"Bereishit 2a.mp3","title":"Bereishit 2a","description":"Chp. 1 verse 26 - Chp. 2 verse 4: G-d creates man in his image, male and female He created them. He commands him to be fruitful and multiply and have dominion over all of created things. G-d informs him that he is to be a vegetarian, and so too all living being. Chp. 2, on the seventh day Hashem \"rested\" from all His work, and He sanctified the day as Shabbos. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bereishit","id":"93"},{"number":"0","filename":"Bereishit 1b.mp3","title":"Bereishit 1b","description":"Chp. 1 verses 4 - 26: G-d calls the light day and the darkness nigth, and it was evening and morning one day. On the second day He creates the firmament and He separates between the upper waters and the lower waters. On the third day He gathers the waters exposing the dry land and vegetation. On the fourth day He creates the luminaries. On the fifth day He creates sea life and birds. On the six day He creates reptiles, animals, and finally man.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bereishit","id":"94"},{"number":"0","filename":"Ki Tavo 1a.mp3","title":"Ki Tavo 1a","description":"Chp. 26 verses 1 - 14: Introduction, begins with the laws of \"Becurim\" First Fruits. The second tithing during the third year of the schmittah cycle was given to the poor, called \"Maaser Ani.\"","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Tavo","id":"95"},{"number":"0","filename":"Bereishit 1a.mp3","title":"Bereishit 1a","description":"Chp. 1 verses 1 - 4: Introduction, G-d creates the heavens and the earth. The earth is empty and void and darkness hovers over the face of the water. He creates light, and sees that it is good. He separates between the light and the darkness. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bereishit","id":"96"},{"number":"0","filename":"Yitro 3a.mp3","title":"Yitro 3a","description":"Chp. 20 verses 11 - 21: Continues with the last six commandments. The people are terrified so they ask Moshe to be their intermediary with G-d, so he goes up the mt. in a thick cloud. Hashem commands Moshe to tell the people not make idols and to make an alter for bringing sacrifices to Him.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Yitro","id":"97"},{"number":"0","filename":"Yitro 2b.mp3","title":"Yitro 2b","description":"Chp. 20 verses 1 - 11: description of the first four commandments.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Yitro","id":"98"},{"number":"0","filename":"Yitro 2a.mp3","title":"Yitro 2a","description":"Chp. 19 verse 4 - chp. 20 verse 11: G-d tells Moshe what to tell the people, and they answer \"all that G-d has spoken we will do.\" Moshe tells them to purify themselves, separate from their wives for three days, and to not touch the mountain, neither man nor beast. On the third day G-d comes down to the mt. and calls out to Moshe who ascends the mt. G-d once again tells him to warn the people not to touch the mt. and he goes down. Chp. 20 begins the introduction  to the ten commandments.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Yitro","id":"99"},{"number":"0","filename":"Yitro 1b.mp3","title":"Yitro 1b","description":"Chp. 18 verse 13 - chp. 19 verse 3: Yisro gives Moshe advice about appointing judges to help him better serve the people. Yisro returns to his home. Chp, 19, in the third month the nation came to the wilderness of Sinai. Moshe goes up the mountain where G-d gives him a message to tell the people. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Yitro","id":"100"},{"number":"0","filename":"Yitro 1a.mp3","title":"Yitro 1a","description":"Chp. 18 verses 1 - 13: Yisro, Moshe's father in law comes out to the wilderness with Moshe's wife and two children. Moshe tells Yisro about all the miracles that Hashem has performed for the people. He brings sacrifices to G-d and Moshe sits and judges the people. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Yitro","id":"101"},{"number":"0","filename":"Vayikra 2b.mp3","title":"Vayikra 2b","description":"Chp. 5 verses 13 - 26: Concludes the discussion of the guilt offering. Next topic is, unauthorized use of holy things. Continues with the guilt offering brought when one is not sure if he transgressed a commandment whose punishment is excision. Continues with the sins of lying about a deposit or a pledge, robbery, oppression, or finding a lost object, and he swears falsely. He must rectify his transgression, and pay an additional fifth to his victim from whom he stole. And he must also bring a guilt offering for an atonement.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayikra","id":"102"},{"number":"0","filename":"Vayikra 2a.mp3","title":"Vayikra 2a","description":"Chp. 4 verse 1 - chp. 5 verse 13: Begins with the laws of the sin offering. First the sin offering of a high priest who has erred and caused a mistaken action. It continues with an error in judgment taken by the high supreme court and the sin offering that they must bring. It then discusses the sacrifice brought by a ruler who has done a sin against one of the mitzvoth of the Torah. It goes on to discuss the laws of the sin offering of an individual. Chp. 5 continues with the laws of a guilt offering, if he can afford it a sheep, if not, then birds, and if not that, then a meal offering.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayikra","id":"103"},{"number":"0","filename":"Vayikra 1b.mp3","title":"Vayikra 1b","description":"Chp. 2 verse 9 - Chp. 3 verse 17: Continues with the description of the laws of the meal offerings and that salt was needed for all sacrifices. The chp. concludes with the laws of the first fruits. Chp. 3 begins with the laws of an ox that is brought as a peace offering. Continues with a sheep peace offering and then a goat. Chp. ends with a warning not to eat the fat or the blood. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayikra","id":"104"},{"number":"0","filename":"Vayikra 1a.mp3","title":"Vayikra 1a","description":"Chp. 1 verse 1 - chp. 2 verse 9: Introduction, Hashem calls out to Moshe and begins to instruct him concerning the sacrifices. First about a burnt offering of a ox, or a sheep, and then a burnt offering of a bird. Chp. 2, continues with the meal offerings and all of their requirements.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayikra","id":"105"},{"number":"0","filename":"Vayakhel 1b.mp3","title":"Vayakhel 1b","description":"Chp. 35 verse 16 - Chp. 38 verse 20: Continues with a description of the works that were needed for the Mishkan. The men and women came with all their gifts and talents to build the Mishkan. Chp. 36, a description of Bezalel and all the artisans and all the works that were performed for the construction of the Mishkan. Chp. 37, Bezalel makes that Ark, it's poles and it's cover. Also the table, the menorah, and everything needed for them. Chp. 38, the copper alter, and all its vessels, and then the wash basin. The sedra finishes off with the courtyard and all that was needed for it. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayakhel","id":"106"},{"number":"0","filename":"Vayakhel 1a.mp3","title":"Vayakhel 1a","description":"Chp. 35 verses 1 - 15:  introduction, Moshe gathers all the people and he tells them about Shabbos. He reiterates about all the materials that were needed for the Mishkan and all the works that the artisans would need to make. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vayakhel","id":"107"},{"number":"0","filename":"Tzav 2b.mp3","title":"Tzav 2b","description":"Chp. 8 verses 1 - 36 chp. 9 verses 1 - 7: Hashem commands Moshe to bring Aaron, his sons, their garments, and all the sacrifices to the door of the Mishkan. He washes them. He then dresses Aaron in the garments of the high priest and anoints him, the Mishkan, the alter, and all its vessels with oil. Next he dresses Aaron's sons. He brings the sacrifices, performing all the rituals connected to them and to Aaron and his sons. They then spend the next seven days and nights in the Mishkan. Chp. 9 begins with an introduction of Shemini and the eighth day of the dedication of the Mishkan, and the sacrifices that Aaron was commanded to bring.       ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Tzav","id":"108"},{"number":"0","filename":"Tzav 2a.mp3","title":"Tzav 2a","description":"Chp. 6 verse 19 - chp 7 verse 38: Chp. concludes with details of the sin offering. Chp.7 begins with the laws of the guilt offering and the gifts of the hide and the leftover of the meal offering that was given to the officiating priest and or his brothers. Next the laws of the various peace offerings and their time constraints. The prohibition of fats and blood. Chp. concludes with the rituals of the peace offering, and meal offering and the portion given the the priests. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Tzav","id":"109"},{"number":"0","filename":"Tzav 1a.mp3","title":"Tzav 1a","description":"Chp. 6 verse 1 - 19: Introduction,command to priests about the burnt offering and the removal of the ashes from the alter. Command to keep a perpetual fire on the alter. Next the meal offering and all of its details. Also the meal offering of Aaron and his sons on the day of their anointment and the command for the high priest to bring this offering half in the morning and half in the afternoon daily. Next the laws of the sin offering. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Tzav","id":"110"},{"number":"0","filename":"Tetzaveh 2b.mp3","title":"Tetzaveh 2b","description":"Chp. 29 verse 39 - chp. 30 verse 10: Continues with the daily sacrifices. Hashem that He will dwell in the midst of the people and be to them as a G-d. Chp. 30, continues with the golden alter where the incense was brought, and the laws connected with it. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Tetzaveh","id":"111"},{"number":"0","filename":"Tetzaveh 2a.mp3","title":"Tetzaveh 2a","description":"Chp. 28 verse 39 - Chp. 29 verse 39: Continues with the headband, and other garments. Chp. 29, sacrifices that they were to bring at their inauguration. Also the command to Moshe to dress Aaron and his sons in their priestly garments, and for him to officiate for the first seven days.  Ends with the command of the daily sacrifice that was brought in the morning and the  evening.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Tetzaveh","id":"112"},{"number":"0","filename":"Tetzaveh 1b.mp3","title":"Tetzaveh 1b","description":"Chp. 28 verses 4-38: A continuation of the garments, and a description of how they were to be made, and the order that they were to be worn. Then a description of the head band. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Tetzaveh","id":"113"},{"number":"0","filename":"Tetzaveh 1a.mp3","title":"Tetzaveh 1a","description":"Chp. 27 verse 20 - Chp. 28 verse 4: The oil for the Menorah and some of its laws. Chp. 28, Hashem commands Moshe to anoint Aaron and his sons as priests. He was to instruct the artisans on how to make special clothing for Aaron. Then a description of six of the eight garments that he would wear.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Tetzaveh","id":"114"},{"number":"0","filename":"Terumah 2b.mp3","title":"Terumah 2b","description":"Chp. 27 verses 3-19: Continues with description of the Copper Alter, its dimension, vessels, and its poles. Then the description of the outside walls of MIshkan, its boards and its curtains.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Terumah","id":"115"},{"number":"0","filename":"Terumah 2a.mp3","title":"Terumah 2a","description":"Chp. 25 verse 31 - Chp. 27 verse 3: Continues with the \"Menorah\" with all its details and its vessels. Chp. 26 begins with the curtains which would be used for the roof and coverings of the outside boards,its loops and clasps. Next a description of the walls which were made  of cedar boards, with silver sockets, rings, and bars. Then a description of the curtain that would separate the Holy from the Holy of Holies. Chp. 27 begins with a description of the Copper Alter. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Terumah","id":"116"},{"number":"0","filename":"Terumah 1b.mp3","title":"Terumah 1b","description":"Chp. 25 verses 10-30: Continues with the description of the Ark; its dimensions, materials, poles, laws, and how it should be made. Then a description of the cover for the Ark, the \"Cherubim\" and all of its details. Next a description of the Golden Table, where the showbreads would be kept, its poles and its vessels.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Terumah","id":"117"},{"number":"0","filename":"Terumah 1a.mp3","title":"Terumah 1a","description":"Chp. 25 verses 1-10: Introduction, Hashem commands Moshe to collect fifteen types of gifts form the people to build Him a Mishkan, (s dwelling place). Hashem begins with a description of the Ark. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Terumah","id":"118"},{"number":"0","filename":"Shemot 3b.mp3","title":"Shemot 3b","description":"Chp. 5 verse 23 - Chp. 6 verse 1: Moshe complains to Hashem that things only got worse not better when he went to Pharaoh. Chp. 6, Hashem assures Moshe that now he would witness what He will do to Pharaoh and that he will drive them out of his land.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shemot","id":"119"},{"number":"0","filename":"Shemot 3a.mp3","title":"Shemot 3a","description":"Chp. 4 verse 2 - chp. 5 verse 22: Hashem gives Moshe signs to show the people. Moshe refuses and G-d gets angry. Hashem tells him that Aaron will be his spokesman. He returns to Midian. He leaves with his family and Zipporah circumcises their newborn son to save his life. Aaron goes out to meet Moshe and they return to Egypt and tell the people what they were commanded to say and are believed. Chp. five, they go to Pharaoh but he refuses to release the people. He increases the burden on the people by making them gather their own straw.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shemot","id":"120"},{"number":"0","filename":"Shemot 2b.mp3","title":"Shemot 2b","description":"Chp. 3 verse 11 - Chp. 4 verse 1: Moshe tells G-d to send someone else. Hashem answers his concerns and assures him that He will be with him and he will be successful. Chp. four, begins with Moshe still not certain that the people will believe that G-d appeared to him.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shemot","id":"121"},{"number":"0","filename":"Shemot 2a.mp3","title":"Shemot 2a","description":"Chp. 2 verse 16 - chp. 3 verse 10: Moshe goes to Midian and there by the well he mets Yisro's daughters. He marries Zipporah and she bears him a son. The king of Egypt dies, the Jews cry out, and Hashem remembers them. Chp. three begins with Moshe tending the sheep of Yisro in the wilderness. Hashem appears to him in the burning bush. Hashem tells Moshe that He is ready to free His people from bondage and to bring them to the land of Canaan, and that Moshe would be His messenger.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shemot","id":"122"},{"number":"0","filename":"Shemot 1b.mp3","title":"Shemot 1b","description":"Chp. 2 verses 1 - 15: We are introduced to Amram and Yochevet. Moshe is born and she hides him for three months. Moshe is put in the Nile and found by the daughter of Pharaoh. She adopts him and names him Moshe. He kills the Eygptian, and Pharaoh tries to execute him, but he flees.    ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shemot","id":"123"},{"number":"0","filename":"Shemot 1a.mp3","title":"Shemot 1a","description":"Chp. 1 verse 1 - Chp. 2 verse 1: The book begins with the names of the sons of Yaakov who came down to Egypt. The B'nai Yisrael multiplied miraculously. The Egyptians embittered their lives. Pharaoh tries to get the Jewish midwives to kill the male babies but they refuse. So then he has all male Jewish babies thrown into the Nile, but he allows the females to live.      ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shemot","id":"124"},{"number":"0","filename":"Shemini 2b.mp3","title":"Shemini 2b","description":"Chp. 11 verses 32 - 47: Continues with the laws of creepy things. Then the laws of earthenware vessels. Liquids that prepare things to become unclean. Mikvah, the defilement of produce. The laws of a dead carcass. The prohibition of eating insects. The command to sanctify ourselves so that we can be G-dly. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shemini","id":"125"},{"number":"0","filename":"Shemini 2a.mp3","title":"Shemini 2a","description":"Chp. 10 verse 8 - chp. 11 verse 31: Hashem speaks to Aaron about prohibition of priest drinking wine before performing service. Continues with the sacrifices of the day and also those laws that would apply for the future. Moshe was angry with them because of an error that he thought they had made, but Aaron told him that they had not erred and he agreed. Chp. 11, deals with the laws of kosher animals, fish, and birds. Ends with the eight creepy things that cause defilement by touching them. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shemini","id":"126"},{"number":"0","filename":"Shemini 1a.mp3","title":"Shemini 1a","description":"Chp. 8 verse 7 - chp. 10 verse 7: Continues with the sacrifices that were brought by Aaron and his sons on the eighth day of dedication. Then they blessed the people and a heavenly fire came and consumed all the sacrifices on the alter Chp. 10 tells us about Nadav and Abihu two sons of Aaron who bring a strange fire into the Holy of Holies and are killed by fire. Their bodies are removed and Aaron and his other two sons are commanded by Moshe not to mourn nor to leave the Mishkan.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shemini","id":"127"},{"number":"0","filename":"Pekudei 1b.mp3","title":"Pekudei 1b","description":"Chp. 39 verse 43 - Chp. 40 until the end of the book: It continues with the blessing the Moshe gave the people. Chp. 40 begins with a command from Hashem to Moshe to erect the Mishkan on the first day of the first month. He was to place all the vessel therein. Then he was to wash Aaron and his sons, dress them, and then anoint them. And so he did. When he was done the cloud covered the tent and the glory of G-d filled the Mishkan. Whenever the cloud would rise above the Mishkan, the people would travel and when it rested so did they. And it was a cloud during the day and a pillar of fire at night, that was seen by all of Israel throughout their journeys. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Pekudei","id":"128"},{"number":"0","filename":"Pekudei 1a.mp3","title":"Pekudei 1a","description":"Chp. 38 verses 21 - chp. 39 verse 43: Introduction, the portion begins with an accounting of all the materials that were used in the construction of the Mishkan. Chp. 39 begins with the materials needed for Aaron's holy garments, and a description of the garments themselves. Then it states that they brought the Mishkan and all its vessels and the all the clothing for Aaron and his sons to Moshe, and he saw that they had done everything precisely as G-d had commanded, and he blesses them.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Pekudei","id":"129"},{"number":"0","filename":"Mishpatim 3a.mp3","title":"Mishpatim 3a","description":"Chp. 22 verse 28 - Chp. 23 verse 26: Continues with first born gift of a sheep or ox, and the commandment to be holy, and to not eat trief. Chp. 23, the laws of false testimony, and returning a lost animal. Not to pervert justice nor take a bribe. Warning about oppressing the stranger. The laws of Shemittah, Shabbos, and the three festivals. The prohibition of milk and meat. A prophecy of the future when the angel of Hashem will lead them into the land, and a warning not to serve their gods, only Hashem and He will bless you.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Mishpatim","id":"130"},{"number":"0","filename":"Mishpatim 2b.mp3","title":"Mishpatim 2b","description":"Chp. 22 verses 8-28: Continues with laws of unpaid watchman. Laws of paid watchman and borrower. Laws of a seducer, sorcerer, and bestiality. Laws of the stranger, widow, and orphans. Laws of interest and taking of a pledge. Cursing a judge or a ruler, and the laws of first fruits, and other holy gifts.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Mishpatim","id":"131"},{"number":"0","filename":"Mishpatim 2a.mp3","title":"Mishpatim 2a","description":"Chp. 21 verse 26 - Chp. 22 verse 8: Laws of injuring a gentile slave. The laws of a goring ox. The laws of an open pit. Laws of one who steals an ox or sheep and sells or kills it. Chp. 22, laws of the burglar. Laws of destruction of property and arson. Laws of the unpaid watchman.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Mishpatim","id":"132"},{"number":"0","filename":"Mishpatim 1b.mp3","title":"Mishpatim 1b","description":"Chp. 21 verse 10-25: Continues with the laws of the Jewish female slave. Laws of the unintentional and intentional murderers. One who hits his parents. The kidnaper, one who curses his parents, and the case of assault. The case of a master who kills his man or maid servant. The unintentional killing of a fetus, and the laws of compensation.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Mishpatim","id":"133"},{"number":"0","filename":"Mishpatim 1a.mp3","title":"Mishpatim 1a","description":"Chp. 21 verses 1-10: Introduction. begins with the laws of the Hebrew slave, and the conditions of his servitude. Continues with the laws of a father selling his daughter as a slave. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Mishpatim","id":"134"},{"number":"0","filename":"Ki Tisa 3b.mp3","title":"Ki Tisa 3b","description":"Chp. 34 verses 28 - 35: Moshe is on the mountain for forty days and nights. He descends unaware that there is a ray of light emanating from his face. The people were afraid but he called them near. When he finished speaking he placed a veil on his face. He would remove  the veil only when he spoke to them or when he spoke to Hashem. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Tisa","id":"135"},{"number":"0","filename":"Ki Tisa 3a.mp3","title":"Ki Tisa 3a","description":"Chp. 33 verse 17 - Chp. 34 verse 28: Hashem concedes to Moshe's request. Moshe asks to see G-d's glory, He places him in the cleft of a rock and allows him to see His backside. Chp. 34, Hashem commands Moshe to hew out two new tablets and to bring them up the mountain. Hashem teaches him the thirteen attributes of mercy. Hashem promises to take them to the land but He warns them not to make a covenant with the inhabitants of the land, for it will lead to idol worship. Commands about idols, Pesach, redemption of the firstborn, Shabbos, Shavuous, bechurim, and the prohibition of milk and meat.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Tisa","id":"136"},{"number":"0","filename":"Ki Tisa 2b.mp3","title":"Ki Tisa 2b","description":"Chp 32 verse 15 - Chp. 33 verse 16: Moshe comes down from the mountain, when he sees the calf he becomes angry and breaks the tablets. He burns the calf and makes them drink from its ashes. Aaron then explains what occurred during his absence. Moshe gathers the tribe of Levi and they kill those that worshiped the calf. He begs Hashem to forgive the people or erase his name from His book. Chp. 33, Hashem tells Moshe to leave the mountain and an angel not He, would lead them to the land. Moshe moves his tent outside the camp. Moshe tells Hashem that if HE doesn't lead them then they don't want to leave.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Tisa","id":"137"},{"number":"0","filename":"Ki Tisa 2a.mp3","title":"Ki Tisa 2a","description":"Chp. 32 verses 4 - 15: Aaron took their gold and fashioned a golden calf. He then built an alter, and the next morning they brought sacrifices to the calf and worshiped it. G-d told Moshe to descend from the mountain since the people had sinned. Hashem threatens to destroy the nation but Moshe pleads with Him not to do so, and Hashem agrees to not destroy them. Moshe then comes down the mountain with the two tablets in his hand. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Tisa","id":"138"},{"number":"0","filename":"Ki Tisa 1b.mp3","title":"Ki Tisa 1b","description":"Chp. 31 verse 3 - Chp. 32 verse 3: Continues with Bezalel's credentials and his assistant Oholiab, and all that they would be commanded to make for the mishkan and for the Priests. Then a warning that the work of the Mishkan should not desecrate the Shabbos, and it should be kept forever as a remembrance of the six days of creation and the seventh day of rest. Then G-d gave him the two tablets of stone. Chp. 32, Moshe was late coming down from the mountain and the people demanded of Aaron the he make them a god, who would lead them. He told them to bring him their wives and children's jewelery, but they refused and so then they brought their own.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Tisa","id":"139"},{"number":"0","filename":"Ki Tisa 1a.mp3","title":"Ki Tisa 1a","description":"Chp. 30 verse 11 - chp. 31 verse 3: Introduction, Hashem commands that the people be counted with the half shekal, and it would be used for the Mishkan and be an atonement. Next the coppper wash basin and its laws. Then Hashem commands Moshe to make the anointing oil, and to use it to anoint the vessels in the Mishkan and also Aaron and his sons. The chp. concludes with the ingredients needed for the incense that was burned on the golden alter daily. Chp. 31, begins with Hashem choosing Bezalel to be the master builder of the Mishkan, and an assurance that Hahsem had blessed him with great wisdom and knowledge. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ki Tisa","id":"140"},{"number":"0","filename":"Bo 3b.mp3","title":"Bo 3b","description":"Chp. 13 verse 14-16: Discourse on the laws and meaning of the mitzvah of tefillin.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bo","id":"141"},{"number":"0","filename":"Bo 3a.mp3","title":"Bo 3a","description":"Chp. 12 verse 43 - Chp. 13 verse 14: More laws about the Pesach. Chp. 13, describes the sanctification of the firstborn of man or animal. The law of telling your son about the redemption from Egypt, haggadah. The laws of Tefillin. The laws of redeeming the firstborn donkey with a sheep, and the simple sons question. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bo","id":"142"},{"number":"0","filename":"Bo 2b.mp3","title":"Bo 2b","description":"Chp. 12 verses 19 -42: Finishes off the laws of Pesach. Then the command about the blood as a sign, and a final command for the holiday to be celebrated forever. The description of the plague of the firstborn, and the Jews departure from Egypt. Then they traveled from Rameses to Succoth.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bo","id":"143"},{"number":"0","filename":"Bo 2a.mp3","title":"Bo 2a","description":"Chp. 11 verse 9 - chp. 12 verse 19: Chp. 11 ends with Hashem explaining to Moshe that Pharaoh would not listen \"in order to multiply My wonders in the land of Egypt.\"  Chp. 12 begins with the first Mitzvah given to the Jewish people, sanctifying the New Moon. Next the command to take a sheep on the tenth of the month and tie it to their bedpost, and all the commandments connected with it, for then and for the future.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bo","id":"144"},{"number":"0","filename":"Bo 1b.mp3","title":"Bo 1b","description":"Chp. 10 verse 23 - chp. 11 verse 8: After plague of darkness Pharaoh agrees to release all the people but not the animals, to worship in the wilderness. Moshe refuses and Pharaoh drives him out, with a warning not to see him again, Moshe agrees. Chp. 11 begins with Hashem telling Moshe that He would bring one more plague on the Egyptians and then they would drive the Jewish nation out of their land. Hashem tells Moshe to ask the people to borrow silver and gold from their Egyptian nieghbors. While still in the palace, Moshe warns Pharaoh of the 10th and final plague, the killing of the firstborn.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bo","id":"145"},{"number":"0","filename":"Bo 1a.mp3","title":"Bo 1a","description":"Chp. 10 verse 1 - 23: Hashem commands Moshe to go to Pharaoh and to warn him about the plague of locusts. The locusts cover the land of Egypt. Pharaoh pleads with Moshe to remove the locusts which he does. Pharaoh still refuses to release the Jewish nation. Moshe then brings the plague of darkness.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bo","id":"146"},{"number":"0","filename":"Beshalach 3b.mp3","title":"Beshalach 3b","description":"Chp. 16 verse 27 - Chp. 17: Hashem questions Moshe about the peoples' sincerity. They name the heavenly food \"mann\" and Moshe puts some in a jar to be saved for eternity. Chp. 17, the people travel to Rephidim and they demand that Moshe give them water. Hashem instructs Moshe to hit the rock and it would give forth water. They call the place Massah and Meribah.  Amalek comes and attacks the nation. Moshe tells Yehoshua to take men and battle with them and he defeats them. Hashem tells Moshe about the command to wipe out the memory of Amalek. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Beshalach","id":"147"},{"number":"0","filename":"Beshalach 3a.mp3","title":"Beshalach 3a","description":"Chp. 15 verse 26 - Chp. 16 verse 27: Chp. finishes with their stay at Elim. Chp. 16, from Elim they reach the wilderness of Sin. The people complain about a lack of food. Hashem tells Moshe to tell the people that He will have it rain Mann from heaven everyday except Shabbos when they will receive a double portion. Hashem would give them quail in the evening and mann in the morning. They were instructed not to leave over any mann for the morning and if they did it would turn to worms and maggots and stink, not everyone obeyed. On the sixth day they saw that they had a double portion and Moshe then instucted them about Shabbos. He told that the mann would not fall on Shabbos but some people still went out to collect but none was found.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Beshalach","id":"148"},{"number":"0","filename":"Beshalach 2b.mp3","title":"Beshalach 2b","description":"Chp. 15 verses 5 - 26: continues with the verses of the \" awz yashir.\" After the men finish singing, Miriam and the women sing separately. They travel to Marah where Moshe sweetens the bitter waters. Moshe then instructs them, that if they follow the will of G-d then they would be protected from all the diseases that were brought upon the Egyptians. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Beshalach","id":"149"},{"number":"0","filename":"Beshalach 2a.mp3","title":"Beshalach 2a","description":"Chp. 14 verse 23 - Chp. 15 verse 5: The Egyptians pursue the poeple into the sea. Hashem commands Moshe to stretch forth his hand over the sea and the waters covered the Egyptians. Chp. ends with the famous phrase found in the daily morning prayer about faith in G-d and believing in Moshe His servant. Chp. 15, continues with the \"awz yashir\" the Jewish nation singing praise to G-d for saving them. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Beshalach","id":"150"},{"number":"0","filename":"Beshalach 1b.mp3","title":"Beshalach 1b","description":"Chp. 14 verses 5 - 22: Pharaoh harnesses his own chariot and gathers his army to destroy the Jewish nation. The people are terrified when they see the Egyptians. They complain to Moshe and there are different approaches as what to do. He assures them that this would be the last time that they would see the Egyptians. They spend the night with the Egyptian army at their back separated by the cloud. Moshe stretches forth his hand and the waters are divided, and the Jewish nation enters the sea.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Beshalach","id":"151"},{"number":"0","filename":"Beshalach 1a.mp3","title":"Beshalach 1a","description":"Chp. 13 verse 17 - Chp. 14 verse 5: Pharaoh escorts the people out of Egypt. They travel into the wilderness, with the cloud leading them during the day and the pillar of fire at night. Chp. 14, begins with Hashem instructing Moshe to return the people back towards Egypt so that Pharaoh would chase them into the wilderness for his final punishment. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Beshalach","id":"152"},{"number":"0","filename":"Devarim 1a.mp3","title":"Devarim 1a","description":"Chp. 1 verses 1 - 14: Introduction, Moshe reviews the details of the travels of the nation from the going out from Egypt to the border of the Jordan, in the plains of Moav.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Devarim","id":"153"},{"number":"0","filename":"Bechukotai 2b.mp3","title":"Bechukotai 2b","description":"Chp. 27 verses 32 - 34: The portion and the Book of Vayikra end with the law of tithing animals. The last verse ends with the words, \" these are the commandments that the L-rd commanded Moshe for the children of Israel in mount Sinai.\"","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bechukotai","id":"154"},{"number":"0","filename":"Acharei Mot 2b.mp3","title":"Acharei Mot 2b","description":"Chp. 18 verses 6 - 30, continues with Kedoshim Chp. 19 verses 1 - 11: Description of prohibited sexual relations. Prohibitions of serving Molech, homosexuality, bestiality, so that the land will not vomit you out as it did to the previous nation. Chp. 19, continues with the portion of Kedoshim and the command to be holy, because G-d is holy. The commands to respect you parents, guard the Shabbos, not to worship nor make idols. Next the laws of a peace offering and its time restrictions. The laws of leaving the corner, and the gleanings of your field,and the gleaning and the fallen fruit of your vineyard you shall leave for the poor and the stranger.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Acharei","id":"155"},{"number":"0","filename":"Emor 1a.mp3","title":"Emor 1a","description":"Chp. 21 verse 1 - Chp. 22 verse 11: Introduction, the laws of a priest; which relatives he must defile himself for, whom he may not marry, and other restrictions that would prevent him from serving Hashem in the sanctuary. Chp. 22 continues with laws of holy foods and when and who could eat them.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Emor","id":"156"},{"number":"0","filename":"Emor 1b.mp3","title":"Emor 1b","description":"Chp. 22 verse 11 - Chp. 23 verse - 8: Continues with holy foods and when and who could eat them. Next discusses the blemishes that would invalidate an animal from being brought as a sacrifice. Also the prohibition of spading an animal. An animal must be at least eight days old to be brought as an offering. The laws that applied to a Toda sacrifice. Chp. 23 Begins with the command to work six days and to keep the seventh as the holy Sabbath. Continues with the holidays beginning with Pesach and its laws. ","ultime":"2014-05-14","dir":"mp3\/NC\/","parashah":"Emor","id":"157"},{"number":"0","filename":"Behar2.mp3","title":"Behar2","description":"","ultime":"2012-08-01","dir":"mp3\/","parashah":"Behar","id":"158"},{"number":"0","filename":"Behar 1a.mp3","title":"Behar 1a","description":"Chp. 25 verses 1 - 17: Introduction, the laws of the Sabbatical and Jubilee years. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Behar","id":"159"},{"number":"0","filename":"Emor 2b.mp3","title":"Emor 2b","description":"Chp. 23 verse 43 - Chp. 24 verse 23: Chp. finishes with the laws of Succoth. Chp. 24, discusses the oil for the Menorah and the obligation of the priests to keep them burning continuously. The twelve showbread were to be made of fine flour and arranged in two rows on the golden table. The portion ends with the blasphemer being stoned by the people.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Emor","id":"160"},{"number":"0","filename":"Emor 2a.mp3","title":"Emor 2a","description":"Chp. 23 verses 9 - 43: Continues with the laws of the Omer offering, and the counting of fifty days to Shavuous. Continues with the sacrifices of the holiday and the offering of the first fruits. Next laws of Rosh Hashanah, Yom Kippur, and Succoth.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Emor","id":"161"},{"number":"0","filename":"Behar 1b.mp3","title":"Behar 1b","description":"Chp. 25 verses 17 - 38: Continues with the laws of the Sabbatical year. The laws of a hereditary field. The laws of a hereditary house in a walled and open city. The prohibition of taking interest.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Behar","id":"162"},{"number":"0","filename":"Kedoshim 2b.mp3","title":"Kedoshim 2b","description":"Chp. 20 verses 24 - 27: Continues with Hashem promise to give the land flowing with milk and honey to the nation that He had separated for Himself as His people. On the condition that you separate yourselves between clean and unclean beast and fowls or anything that creeps on the  ground. You shall be holy unto me for I am holy, and I have set you apart from all peoples so that you should be mine. Portion ends with a warning not to be connected with ghosts or spirits least you be stoned to death. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Kedoshim","id":"163"},{"number":"0","filename":"Kedoshim 2a.mp3","title":"Kedoshim 2a","description":"Chp. 19 verse 19 - chp. 20 verse 24: Continues with the laws of prohibited mixtures. The prohibition of having sexual relations with a maid servant, and its laws. The laws of Orlah. The prohibitions of eating blood, divination, and cutting the corners of your head or beard. Not to cut your flesh in mourning, or s tattoo. Not to give your daughter to harlotry. Keeping Shabbos and showing reverence the sanctuary. Not to seek out ghosts or spirits, and showing respect for the elderly. Treating the convert well. Laws of weights and measures. Chp. 20, begins with the prohibition of the idol Molech, and G-d's punishment. The punishment for cursing parents  Continues with the punishments for the forbidden sexual relations mentioned in previous sedra. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Kedoshim","id":"164"},{"number":"0","filename":"Kedoshim 1a.mp3","title":"Kedoshim 1a","description":"Chp. 19 verses 12 - 18: Continues with the prohibitions of stealing, dealing falsely, and lying. One should not swear falsely in G-d's name. The laws of employment. Not to curse a deaf mute, or put a stumbling block in anothers path. Not to pervert justice, nor be a talebearer. Nor standing idly by while one is being harmed. Not to hate your brother in your heart, but to rebuke him. Not to take vengeance, nor bear a grudge, but to love your neighbor as yourself.      ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Kedoshim","id":"165"},{"number":"0","filename":"Acharei Mot 1a.mp3","title":"Acharei Mot 1a","description":"Chp. 16 verses 1 - 16: Introduction, begins with after the death of the two sons of Aaron and a warning from Hashem not to enter the Holy of Holies at will. It would only be allowed on Yom Kippur and following the exact ritual that Hashem would describe. Portion continues with a description of the Yom Kippur service that could only be done by the High Priest. Also the ritual of the two goats one to G-d and the other to Azazel.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Acharei","id":"166"},{"number":"0","filename":"Metzora 1b.mp3","title":"Metzora 1b","description":"Chp. 14 verse 35 - chp. 15 verse 36: Continues with the laws of the leprosy of a house. Chp. 15 begins with the laws of a Zav or Zavah, all the details of their defilement and all the details of their purification. The laws of a seminal emission. Laws of anyone or anything that touches a Zavah. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Metzora","id":"167"},{"number":"0","filename":"Metzora 1a.mp3","title":"Metzora 1a","description":"Chp. 14 verses 1 - 34: Introduction, the ritual of purification of the leper by the priest. Continues with the leprosy of a house in the land of Israel. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Metzora","id":"168"},{"number":"0","filename":"Tazria 1b.mp3","title":"Tazria 1b","description":"Chp. 13 verses 3 - 59: Continues with the laws of the leper. The part the priest plays in proclaiming the person clean or unclean, and placing him in isolation. The different types of leprosy and the places on the body that it may appear. Leprosy found on clothing, and its laws. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Tazria","id":"169"},{"number":"0","filename":"Naso 1a.mp3","title":"Naso 1a","description":"Chp. 4 verse 21 - chp. 5 verse 9: Introduction, begins with the count of the family of Gershon, and a description of their duties in the Mishkan. Continues with the count of the family of Merari, and a description of their duties in the Mishkan. Then a total count of all the Levites. Chp. 5, now that the three camps were defined, some of the laws of defilement of the camps are discussed. Continues with one who steals and swears falsley, and the fifth that he must pay. Then regarding the property stolen from a convert which is given to the priests. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Naso","id":"170"},{"number":"0","filename":"Massei 1b.mp3","title":"Massei 1b","description":"Chp. 35 verse 6 - Chp. 36 verse 13: Continues with the cities of the Leviim. The Torah then discusses the six cities of refuge and all the laws concerning them and the person who killed another individual. Chp. 36, members from the tribe of Menashah complain to Moshe about the daughters of Zelophehad who were given their father's inheritance in the land concerned that they would marry outside the tribe and their land would be taken by their husbands. Moshe addresses their concerns and Zelophehad's daughters all marry men from their own tribe. End of the book of Bamidbor. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Massei","id":"171"},{"number":"0","filename":"Beha'alotecha 1b.mp3","title":"Beha'alotecha 1b","description":"Chp. 9 verse 7 - Chp. 10 verse 28: Hashem tells Moshe about the laws of Pesach Sheni. Description of the cloud and the fire that hovered over the Mishkan day and night. By the word of G-d they traveled and camped. this they were shown by the cloud that rested on the Mishkan. Chp. 10, Moshe is commanded by G-d to make to silver trumpets, to assemble the people or the princes,and to make them travel. The priests were also commanded to blow trumpets throughout the generations in times of war and in times of gladness of the holidays. Continues with the travels of the nation in the second year, and how the camps traveled. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Beha'alotecha","id":"172"},{"number":"0","filename":"Pinchas 1a.mp3","title":"Pinchas 1a","description":"Chp. 25 verse 9 - Chp. 26 verse 23: Introduction, Hashem tells Moshe to induct Pinchas into the priesthood as a reward, for his act of killing Zimri and Cosbi. Hashem then tells Moshe and Elazar the priest to count the men between the ages of 20 to 60 years of age. They counted them according to their families and names. This information would be used to divide the land according to a lottery. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Pinchas","id":"173"},{"number":"0","filename":"Matot 1b.mp3","title":"Matot 1b","description":"Chp. 31 verse 14 - Chp. 32 verse 42: Moshe rebukes the officers for not killing out the women, who were the cause of sins at Shittim. Moshe tells them to purify themselves. It then discusses the laws of kashering vessels. Continues with a description of how the booty was divided. Chp. 32 begins with the request of the tribes of Reuven and Gad to take possession of the land on the east side of the Jordan. At first Moshe is angry because he thinks that they were trying to avoid the war to conquer the land of Israel. They assure him that not only will they fight but that they would lead the army. Moshe then agrees that if they fulfill their promise that they and half the tribe of Menashah would be able to take their portion in Trans Jordan. He then apportions the land to them.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Matot","id":"174"},{"number":"0","filename":"Pinchas 2b.mp3","title":"Pinchas 2b","description":"Chp. 28 verse 11 - Chp. 30 verse 1: Continues with the sacrifices brought on Rosh Chodesh. Next the laws of Pesach and its sacrifices and then Shevuos. Chp. 29 begins with the laws and the sacrifices of Rosh Hashanah, Yom Kippor, Succoth, and Shimini Atzerath.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Pinchas","id":"175"},{"number":"0","filename":"Pinchas 2a.mp3","title":"Pinchas 2a","description":"Chp. 27 verse 15 - Chp. 28 verse 11: Hashem tells Moshe to appoint Yehoshua as his successor. Chp. 28 discusses the laws of the continual burnt offerings of the morning and the afternoon. Continues with the sacrifices brought on Shabbath.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Pinchas","id":"176"},{"number":"0","filename":"Pinchas 1b.mp3","title":"Pinchas 1b","description":"Chp. 26 verse 23 - Chp. 27 verse 14: Continues with Moshe and Elazar counting the men of the tribes who would inherit the land. Continues with a count of the families of the tribe of Levi but they would not inherit a portion in the land. Chp. 27 continues with the daughters of Zelophehad asking for their father's portion in the land. Moshe asks Hashem for the answer to their question. The answer is yes and then Hashem teaches him about the laws of inheritance. G-d then tells Moshe to ascend mount Abarim to see the land which He had given to the children of Israel. Afterwards he would die just as Aaron had since they had sinned at the waters of Meribath-Kadesh. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Pinchas","id":"177"},{"number":"0","filename":"Korach 1a.mp3","title":"Korach 1a","description":"Chp. 16 verses 1 - 15: Introduction, portion deals with the rebellion of Korach and his group against Moshe and Aaron. Moshe proposes a test to prove that Hashem had chosen Aaron to be the high preist. Moshe goes to Dasan and Aviram to try and placate them but to no avail. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Korach","id":"178"},{"number":"0","filename":"Balak  2b.mp3","title":"Balak  2b","description":"Chp. 24 verse 20 - Chp. 25 verse 9: Continues with Bilaam's prophecy of the end of days. They both go their own way. Chp. 25, The Moabite women seduce the Jewish men in Shittim, and cause them to serve and bow down to their gods. Hashem tells Moshe to have the heads of the people judge those who served the Baal Peor and and execute them, and so they did. A man brought a Midianite women before Moshe while all the people wept. Pinchas the son of Eleazar the son of Aaron the priest took his spear and killed them both in the tent. This brought an end to the plague in the camp. Twenty four thousand men died by the plague. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Balak","id":"179"},{"number":"0","filename":"Balak 2a.mp3","title":"Balak 2a","description":"Chp. 23 verse 18 - Chp. 24 verse 20: Once again Bilaam blesses the Jews instead of cursing them. Balak takes him to another location hoping that he would be more successful there. Bilaam then instructs him to build another seven alters and he sacrifices a bull and a ram on each. Chp. 24, Bilaam tries another method in the hope of being able to outsmart G-d and curse the Jews. Balak is furious and tells Bilaam to hurry back to his home. He reminds Balak that he had told him initially that he could only say what Hashem would tell him to say. He then gives him advice on how to make the Jews stumble through harlotry which is despicable in the eyes of Hashem. Bilaam then tells him a prophecy concerning the end of days.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Balak","id":"180"},{"number":"0","filename":"Balak 1b.mp3","title":"Balak 1b","description":"Chp. 22 verse 29 - Chp. 23 verse 17: Continues with the story of Bilaam and his donkey. The angel warns him to say only that which G-d wants his to say. He comes to Moav and Balak takes him to Bamoth-baal where he could see part of the people. Chp. 23, Bilaam tells Balak to build him seven alters and he sacrifices a bull and a ram on each. He then goes to speak to Hashem in the hope of cursing the Jews but instead Hashem tells him to bless them. Balak is not happy and so he takes him to another location in the hope of having better results. Balak builds another seven alters and offers another seven bulls and rams. Bilaam returns with the words of Hashem. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Balak","id":"181"},{"number":"0","filename":"Balak 1a.mp3","title":"Balak 1a","description":"Chp. 22 verses 1 - 29: Introduction, Balak the king of Moav fears the Jewish Nation. He sends a delegation to  hire Bilaam to curse them. On the way to Moav an angel stands in the road to kill him but only his donkey sees the angel. Miraculously the donkey speaks to Bilaam after he hits it three times.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Balak","id":"182"},{"number":"0","filename":"Chukat 1a.mp3","title":"Chukat 1a","description":"Chp. 19 verses 1 - 16: Introduction, begins with the laws of the \"Red Heifer\" the ultimate statute. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Chukat","id":"183"},{"number":"0","filename":"Chukat 2c.mp3","title":"Chukat 2c","description":"Chp. 21 verses 20 - 35: Continues with the song of praise to Hashem. Moshe sends messengers to Sichon the king of the Amorites to allow them to pass through his land. He refuses and attacks them. He is defeated and all his lands are taken by the Jews. They then turn their attention to Og the king of Bashan and Hashem tells Moshe not to fear him. He too is defeated and his lands are possessed by the Jewish nation.    ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Chukat","id":"184"},{"number":"0","filename":"Chukat 1b.mp3","title":"Chukat 1b","description":"Chp. 19 verse 17 - Chp. 20 verse - 13: Continues with the laws of the Red Heifer. Chp. 20 begins with the death of Miriam. The people complain to Moshe and Aaron about the lack of water. Hashem tells Moshe to talk to the rock and it will bring forth water, but he hits the rock twice. Hashem then informs Moshe, that because he did not fulfill G-ds command properly he would not lead the people into the land.    ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Chukat","id":"185"},{"number":"0","filename":"Korach 2a.mp3","title":"Korach 2a","description":"Chp. 17 verse 9 - Chp. 18 verse 15: Hashem brings a plague on the people and Aaron stops it with his fire pan of incense. Continues with the test of the staffs to prove that the tribe of Levi was chosen by Hashem. Chp, 18, begins with warnings to the people about the Mishkan. Hashem defines the position of the Levites. Continues with the 24 gifts given to the priests. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Korach","id":"186"},{"number":"0","filename":"Korach 2b.mp3","title":"Korach 2b","description":"Chp. 18 verses 15 - 32: Continues with the 24 gifts given to the priests. Then it tells us of the gifts given to the Levites for their service. Also that the Levites are obligated to give a portion of their first tithing to the priests. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Korach","id":"187"},{"number":"0","filename":"Korach 1b.mp3","title":"Korach 1b","description":"Chp. 16 verse 15 - Chp. 17 verse 8: The two hundred and fifty men, Korach, and Aaron all gather with their fire pans filled with incense. Moshe warns the people to separate from the group. Hashem brings a fire that consumes the 250 men and the earth swallows Dasan, Aviram, Korach, their families and all their possessions. Chp. 17 begins with Elazar the son of Aaron collecting all the fire pans. They were to be used as a covering for the copper alter. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Korach","id":"188"},{"number":"0","filename":"Chukat 2b.mp3","title":"Chukat 2b","description":"Chp. 20 verse 14 - Chp. 21 verse 20: Moshe sends messengers to the king of Edom asking for permission to pass through his land, he refuses. They travel to mount Hor and there Aaron dies and is succeeded by his son Elazar, and all the people mourn for him. Chp. 21, begins with the Amalekie attacking they defeat them. The people begin to complain about the conditions in the desert. Hashem punishes them with poisonous snakes and scorpions which kill many of the people. They repent and Hashem tells Moshe to make a copper snake and hang it on a pole and those that look at it will not die. They continue to travel in the wilderness. Hashem performs a miracle for them at the valley of \r\nArnon. When they become aware of this miracle they compose a song of praise to Hashem. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Chukat","id":"189"},{"number":"0","filename":"Shelach 2b.mp3","title":"Shelach 2b","description":"Chp. 15 verses 1 - 41: In this chp. Hashem introduces the wine libation that would accompany many sacrifices. Hashem also commands them about the taking of challah from their dough which would be given to the priests. Continues with the sacrifice brought for an error done by the congregation concerning idol worship. It continues with the individual who sins by error and his sacifice. The Torah mentions many times that there should be one law for you and the convert. Next the story of the gatherer of wood on Shabbos. The portion ends with the Chapter on Tzitzith and its laws. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shelach","id":"190"},{"number":"0","filename":"Shelach 2a.mp3","title":"Shelach 2a","description":"Chp. 14 verses 1 - 45: The people cry in their tents and they complain to Moshe. Joshua and Calev try to convince the people that the land was very good and that Hashem will give them the land. The people threaten to stone them, but they are protected by the glory of G-d. Hashem tells Moshe that He will destroy the nation. Moshe is able to defend the people only to the point of Hashem not destroying them all at one time. He would punish all those between the ages of twenty to sixty with death and wandering in the desert for forty years. Only Joshua and Calev of those between the ages of twenty and sixty would enter the land. The ten spies die by the plague. Against Moshe's words some of the people try to go up and conquer the mountain but they are defeated by the Amalekie and Canaanie.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shelach","id":"191"},{"number":"0","filename":"Beha'alotecha 1a.mp3","title":"Beha'alotecha 1a","description":"Chp. 8 verse 2 - chp. 9 verse 8: Begins with the service of the Menorah and how is was made. Continues with the induction of the Levites to replace the firstborns, and to assist the priests in the service of Hashem. Chp. 9 begins with the only Pesach that was observed by the nation in the desert. Those that were spiritually unclean complained to Moshe about their inability to bring the Pascal sacrifice. Moshe tells them to stand there and wait and he would confer with Hashem.     ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Beha'alotecha","id":"192"},{"number":"0","filename":"Beha'alotecha 2a.mp3","title":"Beha'alotecha 2a","description":"Chp. 10 verse 28 - chp. 11 verse 18: Moshe tries to convince his father in law to stay with the nation. They traveled for three days from the mountain and the Ark traveled a three day journey in front of them. Continues with the two famous verses that we say when we take out or bring in the Torah to the Ark in the synagogue. Chp. 11 tell us about the murmurers, and Hashem punishes them with fire. The people complain about a lack of meat, and the Mann. Moshe complains to Hashem about his burden of taking care of the people, and that he cannot do it alone. G-d tells him to gather seventy elders, and that He would take some of the spirit of Moshe and place it on them and they would help him with the people. Also to tell the people that the next day He would give them meat.    ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Beha'alotecha","id":"193"},{"number":"0","filename":"Beha'alotecha 2b.mp3","title":"Beha'alotecha 2b","description":"Chp. 11 verse 18 - chp. 12 verse 16: Hashem tells Moshe that He will give them meat for a month until it comes out of their nostrils because they complained. He tells Moshe to gather the seventy elders around the Mishkan and Hashem placed the spirit of Moshe upon them, and they began to prophecise. Eldad and Medad begin to prophecise. The quail fell on the camp in great numbers, and many people died. The place was called Kibroth-hattaavah. Chp. 12, Miriam and Aaron speak loshon hara about Moshe. Hashem rebukes them and Miriam is stricken with leprosy. Moshe prays for her recovery. She is quarantined for seven days and the people wait for her to recover before they travel.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Beha'alotecha","id":"194"},{"number":"0","filename":"Tazria 1a.mp3","title":"Tazria 1a","description":"Chp. 12 verse 1 - Chp. 13 verse 3: introduction, the laws of childbirth, circumcision, defilement, purity, and the sacrifices brought after giving birth. Chp. 13, begins the laws of leprosy, and the part the priest plays in the designation and purification of the plague.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Tazria","id":"195"},{"number":"0","filename":"Shelach 1a.mp3","title":"Shelach 1a","description":"Chp 13 verses 1 - 33: Introduction, Moshe is given permission by Hashem to send spies into the land of Canaan. He sends twelve men one from each tribe. The Torah lists their names. They return after forty days with a cluster of grapes, a pomegranate, and a fig. Ten of them give their report to Moshe and the people, with the intent of frightened the people and they succeed. Calev tries to convince the people that the land is wonderful and conquerable. The ten spies try to convince the people that they would not be able to conquer the land and that they also saw giants there.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Shelach","id":"196"},{"number":"0","filename":"Naso 3.mp3","title":"Naso 3","description":"Chp. 7 verses 30 - 89: Continues with the sacrifices and gifts brought by the princes at the dedication of the Alter. Chp. 8 verses 1-2 begin the portion of Beha'alotecha.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Naso","id":"197"},{"number":"0","filename":"Naso 2b.mp3","title":"Naso 2b","description":"Chp. 6 verses 26-27 - Chp. 7 verse 29: Chp. 6 concludes the priestly blessings. Chp. 7, after Moshe erects the Mishkan, the Torah describes the sacrifices and gifts brought by each of the princes on the twelve days of the consecration of the Alter.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Naso","id":"198"},{"number":"0","filename":"Naso 2a.mp3","title":"Naso 2a","description":"Chp. 6 verses 1 - 25: Chapter describes the laws of the Nazir; one who refrains from wine, cutting his hair, and contact with the dead, and all the laws connected with him. Continues with the priestly blessings. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Naso","id":"199"},{"number":"0","filename":"Naso 1b.mp3","title":"Naso 1b","description":"Chp. 5 verses 10 - 31: Continues with the laws of first fruits, and Terumah which the owner gives to which ever priest he chooses. Next is the law of the Sotah. She is the woman who is accused by her husband of secluding herself with another man after being warned in front of witnesses not to do so. She is taken to the Temple where the ritual of the \"bitter waters are performed.\"(Sotah)","ultime":"2012-08-01","dir":"mp3\/","parashah":"Naso","id":"200"},{"number":"0","filename":"Massei 1a.mp3","title":"Massei 1a","description":"Chp. 33 verse 1 - Chp. 35 verse 6: Introduction, Moshe reviews all the travels and major incidents of the nation from their leaving Egypt until their present location, in the plains of Moav. He then warns them about destroying the nations of the land and their idols. Chp. 34, Moshe describes the boundaries of Eretz Yisrael. He then tells them that Elazar and Yehoshua would be the ones to apportion the land. It continues with the names of the princes of all the tribes. Chp. 35, begins with Hashem commanding Moshe to give the Leviim cities within the tribes with land  around their cities.    ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Massei","id":"201"},{"number":"0","filename":"Bamidbar 2b.mp3","title":"Bamidbar 2b","description":"Chp. 4 verses 12 - 20: Continues with the description of the duties of the family of Kehath. Finishes with a stern warning for them to follow the directions given by Moshe and Aaron from Hashem so that they don't die. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bamidbar","id":"202"},{"number":"0","filename":"Bamidbar 2a.mp3","title":"Bamidbar 2a","description":"Chp. 3 verse 1 - chp. 4 verse 12: Introduction to Aaron and his sons that would serve as priests in the Mishkan. The command to Moshe from Hashem to designate the tribe of Levi to serve the priests in the Mishkan, as substitutes for the firstborn Israelites. By Hashem's command Moshe counts the three families of the Levites, by their individual families. He designates which direction they would camp and what their duties would be. Chp. 4 Moshe counts the family of Kehath and describes their duties. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bamidbar","id":"203"},{"number":"0","filename":"Bamidbar 1b.mp3","title":"Bamidbar 1b","description":"Chp. 1 verse 47 - chp. 2 verse 34: The Levites are counted separately since they would serve Hashem in the Mishkan. Chp. 2 describes how the tribes camped and traveled in the desert, their numbers, and their flags. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bamidbar","id":"204"},{"number":"0","filename":"Matot 1a.mp3","title":"Matot 1a","description":"Chp. 30 verse 2 - chp. 31 verse 14: Introduction, begins with oaths and vows. Then continues with oaths and vows of a girl in her father's house and then with her husband. Chp. 31 begins with Hashem commanding Moshe to take revenge against Midian for the incident at Shittim. He sends twelve thousand man out to battle lead by Pinchas. They kill out all the men including Bilaam. They return victorious and are greeted by Moshe, Elazar, and all the princes. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Matot","id":"205"},{"number":"0","filename":"Bamidbar 1a.mp3","title":"Bamidbar 1a","description":"Chp. 1 verses 1  - 46: Introduction, Moshe and Aaron are commanded by Hashem to count the men from the ages of twenty to sixty for military service.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bamidbar","id":"206"},{"number":"0","filename":"Bechukotai 1a.mp3","title":"Bechukotai 1a","description":"Chp. 26 verses 3 - 39: Introduction, begins with the blessings that Hashem will bestow on the people if they follow the Torah. Then it turns to the admonitions if they do not follow the ways of Hashem.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bechukotai","id":"207"},{"number":"0","filename":"Bechukotai 2a.mp3","title":"Bechukotai 2a","description":"Chp. 26 verse 40 - Chp. 27 verse 32: Continues with the admonitions for transgressing the words of the Torah. Ends with a promise not to totally destroy them in the land of their enemies. Chp. 27 begins with the laws of vows of valuation of people. Continues with the consecration of property or animals.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Bechukotai","id":"208"},{"number":"4","filename":"NoachNC4.mp3","title":"NoachNC4 chp. 8 verse 8 until chp. 9","description":"Noach sends out a dove from the ark, earth dries out, he leaves the ark, Hashem allows him to eat meat. ","ultime":"2012-09-05","dir":"mp3\/NC\/","parashah":"Noach","id":"209"},{"number":"9","filename":"Brochos9.mp3","title":"Brochos9","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"210"},{"number":"8","filename":"Brochos8.mp3","title":"Brochos8","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"211"},{"number":"7","filename":"Brochos7.mp3","title":"Brochos7","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"212"},{"number":"6","filename":"Brochos6.mp3","title":"Brochos6","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"213"},{"number":"5","filename":"Brochos5.mp3","title":"Brochos5","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"214"},{"number":"4","filename":"Brochos4.mp3","title":"Brochos4","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"215"},{"number":"3","filename":"Brochos3.mp3","title":"Brochos3","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"216"},{"number":"2","filename":"Brochos2.mp3","title":"Brochos2","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"217"},{"number":"19","filename":"Brochos19.mp3","title":"Brochos19","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"218"},{"number":"18","filename":"Brochos18.mp3","title":"Brochos18","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"219"},{"number":"17","filename":"Brochos17.mp3","title":"Brochos17","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"220"},{"number":"16","filename":"Brochos16.mp3","title":"Brochos16","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"221"},{"number":"15","filename":"Brochos15.mp3","title":"Brochos15","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"222"},{"number":"14","filename":"Brochos14.mp3","title":"Brochos14","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"223"},{"number":"13","filename":"Brochos13.mp3","title":"Brochos13","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"224"},{"number":"12","filename":"Brochos12.mp3","title":"Brochos12","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"225"},{"number":"11","filename":"Brochos11.mp3","title":"Brochos11","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"226"},{"number":"10","filename":"Brochos10.mp3","title":"Brochos10","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"227"},{"number":"1","filename":"Brochos1.mp3","title":"Brochos1","description":"","ultime":"2012-08-01","dir":"mp3\/brochos\/","parashah":"The Laws of Brochos","id":"228"},{"number":"2","filename":"Tehillim Chapter 2 Part 2.mp3","title":"Tehillim Chapter 2 Part 2","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"229"},{"number":"1","filename":"Tehillim Chapter 1 Part2.mp3","title":"Tehillim Chapter 1 Part2","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"230"},{"number":"3","filename":"Tehillim Chapter 3.mp3","title":"Tehillim Chapter 3","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"231"},{"number":"4","filename":"Tehillim Chapter 4.mp3","title":"Tehillim Chapter 4","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"232"},{"number":"5","filename":"Tehillim Chapter 5.mp3","title":"Tehillim Chapter 5","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"233"},{"number":"6","filename":"Tehillim Chapter 6.mp3","title":"Tehillim Chapter 6","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"234"},{"number":"7","filename":"Tehillim Chapter 7.mp3","title":"Tehillim Chapter 7","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"235"},{"number":"8","filename":"Tehillim Chapter 8.mp3","title":"Tehillim Chapter 8","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"236"},{"number":"10","filename":"Tehillim Chapter 10.mp3","title":"Tehillim Chapter 10","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"237"},{"number":"9","filename":"Tehillim Chapter 9.mp3","title":"Tehillim Chapter 9","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"238"},{"number":"12","filename":"Tehillim Chapter 12.mp3","title":"Tehillim Chapter 12","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"239"},{"number":"11","filename":"Tehillim Chapter 11.mp3","title":"Tehillim Chapter 11","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"240"},{"number":"14","filename":"Tehillim Chapter 14.mp3","title":"Tehillim Chapter 14","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"241"},{"number":"13","filename":"Tehillim Chapter 13.mp3","title":"Tehillim Chapter 13","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"242"},{"number":"15","filename":"Tehillim Chapter 15.mp3","title":"Tehillim Chapter 15","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"243"},{"number":"16","filename":"Tehillim Chapter 16.mp3","title":"Tehillim Chapter 16","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"244"},{"number":"17","filename":"Tehillim Chapter 17.mp3","title":"Tehillim Chapter 17","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"245"},{"number":"18","filename":"Tehillim Chapter 18 a.mp3","title":"Tehillim Chapter 18 a","description":"Verses 1-17","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"246"},{"number":"18","filename":"Tehillim Chapter 18 b.mp3","title":"Tehillim Chapter 18 b","description":"Verses 18-32","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"247"},{"number":"18","filename":"Tehillim Chapter 18 c.mp3","title":"Tehillim Chapter 18 c","description":"Verse 32 to end","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"248"},{"number":"145","filename":"Tehillim Chapter 145 a.mp3","title":"Tehillim Chapter 145 a","description":"Verses 1-13","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"249"},{"number":"145","filename":"Tehillim Chapter 145 b.mp3","title":"Tehillim Chapter 145 b","description":"Verse 14 to end","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"250"},{"number":"146","filename":"Tehillim Chapter 146.mp3","title":"Tehillim Chapter 146","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"251"},{"number":"147","filename":"Tehillim Chapter 147.mp3","title":"Tehillim Chapter 147","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"252"},{"number":"1","filename":"Tehillim Chapter 1 Part 1.mp3","title":"Tehillim Chapter 1 Part 1","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"253"},{"number":"2","filename":"Tehillim Chapter 2 Part 1.mp3","title":"Tehillim Chapter 2 Part 1","description":"","ultime":"2012-08-01","dir":"mp3\/tehillim\/","parashah":"Tehillim","id":"254"},{"number":"2","filename":"Davening 2A.mp3","title":"Davening 2A","description":"Morning blessings; bottom of page 5, \"My G-d,the soul\" page 6, the beginning of the 15 blessings.","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"255"},{"number":"1","filename":"Davening 1B.mp3","title":"Davening 1B","description":"Continuing with the introduction. Blessing over washing hands and going to the bathroom.  ","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"256"},{"number":"2","filename":"Davening 2B.mp3","title":"Davening 2B","description":"Page 6, continuing with the 15 blessings","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"257"},{"number":"3","filename":"Davening 3A.mp3","title":"Davening 3A","description":"Page 7: continues with \"And may it be Your will\" bottom of page, through page 25.","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"258"},{"number":"3","filename":"Davening 3B.mp3","title":"Davening 3B","description":"Pages 27-30: \"verses of Praise\" from \"Hodu\" through \"Mizmor Le Soda\" ","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"259"},{"number":"4","filename":"Davening 4A.mp3","title":"Davening 4A","description":"Pages 31-38: \"Yechee Kavod\" through \"Yishtabach\" which ends the \"Verses of Praise.\"","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"260"},{"number":"4","filename":"Davening 4B.mp3","title":"Davening 4B","description":"Pages 38-39: \"Kaddish\"","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"261"},{"number":"5","filename":"Davening 5A.mp3","title":"Davening 5A","description":"Pages 39-42: the blessings of the \"Shema\".","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"262"},{"number":"5","filename":"Davening 5B.mp3","title":"Davening 5B","description":"Pages 42-43: The \"Shema Yisrael\"","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"263"},{"number":"6","filename":"Davening 6A.mp3","title":"Davening 6A","description":"Pages 42-43: Continuing the \"Shema Yisrael\" ","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"264"},{"number":"6","filename":"Davening 6B.mp3","title":"Davening 6B","description":"Pages 43-44: \"Tzitzith\"","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"265"},{"number":"7","filename":"Davening 7A.mp3","title":"Davening 7A","description":"Some of the laws of the \"Shema\", and an overview of the \"Amidah\".","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"266"},{"number":"7","filename":"Davening 7B.mp3","title":"Davening 7B","description":"Pages 45-47: Continuing with overview and the first three blessings. ","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"267"},{"number":"8","filename":"Davening 8A.mp3","title":"Davening 8A","description":"Page 47: Continuing with the blessings of the \"Amidah\"","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"268"},{"number":"8","filename":"Davening 8B.mp3","title":"Davening 8B","description":"Page 47: Continuing with the blessings of the \"Amidah\"","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"269"},{"number":"9","filename":"Davening 9A.mp3","title":"Davening 9A","description":"Bottom of page 47: Blessings of the \"Amidah\"","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"270"},{"number":"9","filename":"Davening 9B.mp3","title":"Davening 9B","description":"Pages 48-49: Continuing with the blessings of the \"Amidah\"","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"271"},{"number":"10","filename":"Davening 10A.mp3","title":"Davening 10A","description":"Bottom of page 49-50: blessings of the \"Amidah\"","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"272"},{"number":"10","filename":"Davening 10B.mp3","title":"Davening 10B","description":"Pages 50-53: Last three blessings in the \"Amidah\"","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"273"},{"number":"11","filename":"Davening 11A.mp3","title":"Davening 11A","description":"Middle of page 53-54: \"May the words\" and \"My G-d, guard my tongue from evil.\" Beginning of \"Viduy\" confession of sin.","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"274"},{"number":"11","filename":"Davening 11B.mp3","title":"Davening 11B","description":"Pages 54-60: Continuing with the \"Viduy\"","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"275"},{"number":"12","filename":"Davening 12A.mp3","title":"Davening 12A","description":"Pages 66-82: Ahsrei, Lahm natzeiach, through Aulenu. Page 118-122: Begins the evening prayer.  ","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"276"},{"number":"12","filename":"Davening 12B.mp3","title":"Davening 12B","description":"Bottom of page 122 concludes the evening prayer. Some closing thoughts on prayer.","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"277"},{"number":"13","filename":"Davening 13A.mp3","title":"Davening 13A","description":"Description of chart, at the back of the siddur, of when to interrupt during prayer.","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"278"},{"number":"13","filename":"Davening 13B.mp3","title":"Davening 13B","description":"Continuation of chart, and series finishes pages 90-95 with the \"Grace\" the blessing after a meal. ","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"279"},{"number":"1","filename":"Davening 1A.mp3","title":"Davening 1A","description":"Introduction, page 5, washing of hands, Modie Ani.","ultime":"2012-08-01","dir":"mp3\/davening\/","parashah":"Davening","id":"280"},{"number":"5","filename":"NoachNC5.mp3","title":"NoachNC5 chp.9 through verse 17","description":"Hashem allows noach to eat meat, He makes a covenant with him using the sign of the rainbow that He would not destroy the earth again.","ultime":"2012-09-12","dir":"mp3\/NC\/","parashah":"Noach","id":"281"},{"number":"0","filename":"Va'eira 1a.mp3","title":"Va'eira 1a","description":"Chp. 6 verses 2 - 13: Introduction, Hashem tells Moshe to tell the people that He is ready to redeem them from Egypt. Moshe tells the people but they don't listen. Then Hashem tells him to tell Pharaoh, but Moshe says that Pharaoh won't listen either since he has a speech impediment. Hashem commands Moshe and Aaron to tell the B'nai Yisrael and Pharaoh that they will take the people out of Egypt. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Va'eira","id":"282"},{"number":"0","filename":"Ha'azinu 1a.mp3","title":"Ha'azinu 1a","description":"Chp. 32 verses 1 - 17: Introduction, Moshe begins his poetic message with a call to heaven and earth to witness his words. He praises Hashem and His justice. He tells them how Hashem had chosen the older generation from among the nations. He cared for them in the wilderness and carried and guarded them as an eagle watches over it's young.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Ha'azinu","id":"283"},{"number":null,"filename":"Va'eira 1b.mp3","title":"Va'eira 1b","description":"Chp. 6 verses 13 - 30: Lists the genealogy of Ruevain, Shimon, and then Levi in depth, inorder to introduce us to Moshe, Aaron, and his family. To tell us that it would be the two of them who would speak to Pharaoh about taking the Jewish people out of Egypt.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Va'eira","id":"284"},{"number":null,"filename":"Va'eira 2a.mp3","title":"Va'eira 2a","description":"Chp. 7 verses 1 - 23; Hashem tells Moshe that Aaron would be his interpreter. Also that He would harden Pharaoh's heart and he would not listen to them, so that Egypt would know that it was G-d who would take the Jews out of Egypt. Aaron performs wonders before Pharaoh, but his magicians duplicate his acts. Moshe then warns Pharaoh and brings the first plague of blood. The magicians duplicate the feat, Pharaoh refuses to let the Jews go sacrifice to their G-d. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Va'eira","id":"285"},{"number":null,"filename":"Va'eira 2b.mp3","title":"Va'eira 2b","description":"Chp. 7 verse 24 - Chp. 8 verse 28: Moshe warns Pharaoh about the plague of frogs. Chp. 8, Aaron brings the frogs on Egypt, which the magicians duplicate. Moshe removes the frogs, but Pharaoh still refuses to release the Jews. Then Moshe tells Aaron to bring the plague of lice, the magicians are not able to duplicate the plague but Pharaoh still refuses to release the Jews. Moshe then brings the fourth plague of wild animals. Pharaoh says that he will allow the Jews to go sacrifice to their G-d but after the plague ends he reneges. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Va'eira","id":"286"},{"number":null,"filename":"Va'eira 3.mp3","title":"Va'eira 3","description":"Chp. 9 verses 1 - 35: Moshe warns Pharaoh and then brings on the fifth plague of pestilence. Again Pharaoh agrees to release the Jews but reneges. Without warning Moshe brings on the sixth plague of boils. Again Pharaoh gives in only to renege. Moshe then warns Pharaoh and brings the seventh plague of Hail. Pharaoh assures Moshe that he will release the people so Moshe goes outside the city to pray to Hashem that the plague should end. When it does, Pharaoh reneges again.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Va'eira","id":"287"},{"number":null,"filename":"Va'etchanan 1b.mp3","title":"Va'etchanan 1b","description":"Chp. 4 verses 2 - 38: Moshe warns the people to follow the commandments meticulously, and to cling to Hashem. If they do so they will be a great nation. He tells them that he will die and not lead them into the land. He warns them what the consequences will be if they do not follow the ways of Hashem. He assures them that the path to forgiveness will always be open for them.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Va'etchanan","id":"288"},{"number":null,"filename":"Va'etchanan 2a.mp3","title":"Va'etchanan 2a","description":"Chp. 4 verse 39 - Chp. 6 verse 3: Moshe concludes his warnings to the people. Continues with him designating  three cities of Refuge, for whoever kills someone by accident. Chp. 5, Moshe repeats the Ten Commandments, and reviews their experience at Mt. Sinai.Chp. 6, Moshe warns the people to keep the Torah so that they will be able to receive the land that flows with milk and honey.                                                                                                                                                                                                                                                                                                                                                                                                                                    ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Va'etchanan","id":"289"},{"number":null,"filename":"Va'etchanan 2b.mp3","title":"Va'etchanan 2b","description":"Chp. 6 verse 4 - Chp. 7 verse 11: Begins with the first paragraph of the \"Shema.\" Moshe then once again warns the nation to keep G-d's laws so that they could inherit the land. Continues with the question of the wise son and the answer. Chp. 7,he warned them against intermarriage, since that would lead to abandoning Hashem and His laws. He reminded them that they were a holy nation, and it was their duty to observe G-d's commandments.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Va'etchanan","id":"290"},{"number":null,"filename":"Re'eh 1a.mp3","title":"Re'eh 1a","description":"Chp. 11 verse 26 - Chp. 12 verse 21: Introduction, Moshe informs the people that they have a choice between blessings and curses, if they chose to follow the commands of G-d or not. He also informs them of the ceremony that would held on the mountains of Gerizim and Eival upon entering Eretz Yisrael. Chp. 12, Moshe reviews some of the laws that would regulate their lives once they entered the land. Laws concerning idols. Laws that would be connected to a central place of worship and sacrifices to Hashem. The prohibition of eating blood. Laws of tithing and to not forget the Levi. The laws of ritual slaughtering.  ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Re'eh","id":"291"},{"number":null,"filename":"Re'eh 1b.mp3","title":"Re'eh 1b","description":"Chp. 12 verse 22 - Chp. 13 verse 19: Begins with the prohibition of eating blood, to do what is proper in the eyes of Hashem and to not follow the ways of the other nations. Chp. 13, warning about a false prophet, and an inciter, and that they should be put to death. Laws of a \"rebellious city.\"","ultime":"2012-08-01","dir":"mp3\/","parashah":"Re'eh","id":"292"},{"number":null,"filename":"Re'eh 2a.mp3","title":"Re'eh 2a","description":"Chp. 14 verse 1 - Chp. 15 verse 7: Prohibition of self inflicted wounds, and of eating anything abominable. The dietary laws are reviewed. The laws of Ma'aser Sheini and where it should be eaten. Chp. 15, The laws of the sabbatical year. ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Re'eh","id":"293"},{"number":null,"filename":"Re'eh 2b.mp3","title":"Re'eh 2b","description":"Chp. 15 verse 7 - Chp. 16 verse 17: Laws of helping the poor. The laws of the hebrew slave. The laws of the firstborn of your flock. Chp. 16, Reviews the laws of Pesach, Shevuous, and Succos. Moshe empahasized that every male Israelite was to make a pilgrimage three times a year to the Sanctuary, bringing with him sacrifices, each person according to his means.   ","ultime":"2012-08-01","dir":"mp3\/","parashah":"Re'eh","id":"294"},{"number":null,"filename":"Vezot Hab'rachah 1a.mp3","title":"Vezot Hab'rachah 1a","description":"Chp. 33 verse 1 - 17: Introduction, before his death Moshe gives his blessings to the nation and to each tribe individually, just like Yaakov before his death. Begins with Ruevain, then Yehudah, Levi, Binyamin, and Yosef.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vezot Hab'rachah","id":"295"},{"number":null,"filename":"Vezot Hab'rachah 1b.mp3","title":"Vezot Hab'rachah 1b","description":"Chp. 33 verse 17 - Chp. 34 verse 12: Continues with Yosef, Zevulun, Yissachar, Gad, Dan, Naphtali, and Asher. Chp. 34, After he concluded his blessings he ascended Mount Nevo and Hashem showed him all the land that the tribes would inherit. Moshe died in the plains of Moav by the mouth of G-d. There he was buried and no one knows his burial site. The nation mourned for him for thirty days. The they turned to their new leader Yehoshua who would guide them in their conquest of the Land of Canaan under Hashem's supervision. The Torah concludes with the words that \" There has not risen a prophet like Moshe, whom the L-rd knew face to face....\"","ultime":"2012-08-01","dir":"mp3\/","parashah":"Vezot Hab'rachah","id":"296"},{"number":"7","filename":"NoachNC7.mp3","title":"NoachNC7 chp. 10 until end of sedra","description":"the descendants of the sons of noach, tower of babel, the dispersion, birth of abram and sarai. ","ultime":"2012-10-10","dir":"mp3\/NC\/","parashah":"Noach","id":"297"},{"number":"6","filename":"NoachNC6 chp.9 verse 18 until end of chp..mp3","title":"NoachNC6 chp.9 verse 18 until end of chp.","description":"Noach plants vineyard, gets drunk, curses cannaan, and blesses shem and yapeth.","ultime":"2012-10-04","dir":"mp3\/NC\/","parashah":"Noach","id":"298"},{"number":null,"filename":"Lech Lecha 1.mp3","title":"Lech Lecha 1","description":"Chp.12 verse 1.  Introduction to the sedra and an overview of first verse","ultime":"2012-10-17","dir":"mp3\/NC\/","parashah":"Lech Lecha","id":"299"},{"number":null,"filename":"Lech Lecha 2.mp3","title":"Lech Lecha 2","description":"Chp. 12 verse 2 - verse 7.  Hashem promises Avraham health, wealth, and children. He gives him the ability to bless others. Avraham leaves Haran with Sarai and Lot and he comes to Shechem were he builds an alter to Hashem.","ultime":"2012-10-25","dir":"mp3\/NC\/","parashah":"Lech Lecha","id":"300"},{"number":null,"filename":"Lech Lecha 3.mp3","title":"Lech Lecha 3","description":"Chp. 12 verse 8 through end of chp. 12.  Avraham builds an alter to Hashem. There is a famine in the land and he goes to Egypt, he tells Sarai to say she is his sister and she is abducted by Pharoh. He showers Avraham with gifts, but he is punished with plagues. He then releases her and gives them a royal escort out of Egypt. ","ultime":"2012-10-31","dir":"mp3\/NC\/","parashah":"Lech Lecha","id":"301"},{"number":null,"filename":"Lech Lecha 4.mp3","title":"Lech Lecha 4","description":"Chp.13 verse 1-18: Avraham leaves Egypt and comes back to Canaan with his wife and Lot. Both are very wealthy which causes quarrels between them. They separate, Lot goes to Sodom, and Avraham goes to Chevron. Hashem then appears to him and promises to give the land of Israel to him and his descendants.  ","ultime":"2012-11-08","dir":"mp3\/NC\/","parashah":"Lech Lecha","id":"302"},{"number":null,"filename":"Lech Lecha 5.mp3","title":"Lech Lecha 5","description":"Chp. 14: Story of the five kings rebelling against the four kings and being defeated. They capture Sodom and take Lot and all the populace captive. Avraham goes to battle against the four Kings to rescue Lot and defeats them. He meets Malchi Tzeddek, who brings him bread and wine. Avraham returns all the people to the king of Sodom but refuses to accept any of the booty.","ultime":"2012-11-14","dir":"mp3\/NC\/","parashah":"Lech Lecha","id":"303"},{"number":null,"filename":"Lech Lecha 6.mp3","title":"Lech Lecha 6","description":"Chp. 15 verses 1-15: After Avram's victory over the 4 kings Hashem assures him that he still has a great deal of merit. Hashem then promises him that he will have an heir and that he will inherit the land. This is called the \"covenant between the parts.\" Hashem has him bring three animals and two birds as part of the ritual. He then tells him that his children will be enslaved for 400 years and the nation that enslaves them will be judged and that they will leave with great wealth. But G-d assures him that this would occur after his death, that he would live in peace. ","ultime":"2012-11-21","dir":"mp3\/NC\/","parashah":"Lech Lecha","id":"304"},{"number":null,"filename":"Lech Lecha 7.mp3","title":"Lech Lecha 7","description":"Chp. 15 verse 16 - chp. 16: Continues with the description of the \"covenant between the parts.\" Chp. 16 discusses the relationship between Sawri, Avram, and Hagar. Also the birth of Yishmael. ","ultime":"2012-11-28","dir":"mp3\/NC\/","parashah":"Lech Lecha","id":"305"},{"number":null,"filename":"Lech Lecha 8.mp3","title":"Lech Lecha 8","description":"Chp. 17: Hashem asks Avram to become perfect with the mitzvah of circumcision. This would be an everlasting covenant between G-d and Avram's children forever. Hashem then changes his name to Avraham and Sawri to Sawra. Hashem promises him the land and a son from Sawra whom he will name Yitzhok. Hashem also promises him that Yishmael will be successful. At age 99, he circumcises himself and all the male members of his household, to include Yishmael who was 13 years old.   ","ultime":"2012-12-05","dir":"mp3\/NC\/","parashah":"Lech Lecha","id":"306"},{"number":null,"filename":"Vayeira 1.mp3","title":"Vayeira 1","description":"Chp. 18 verses 1-3: Introduction, Hashem visits Avraham on the third day after his circumcision. He looks up and sees three men coming towards him and he invites them to be his guests. ","ultime":"2012-12-12","dir":"mp3\/NC\/","parashah":"Vayeira","id":"307"},{"number":null,"filename":"Mishpatim 3b.mp3","title":"Mishpatim 3b","description":"Chp. 23 verse 26 - chp. 24: Hashem promises to be with them when they conquer the land, and a warning not to serve their gods. Chp. 24, deals with the preparations by Moshe before he goes up the mountain to receive the ten commandments.","ultime":"2012-08-01","dir":"mp3\/","parashah":"Mishpatim","id":"308"},{"number":null,"filename":"Vayeira 2.mp3","title":"Vayeira 2","description":"Chp. 18 verses 3-8: Continues with Avraham serving the three men\/angels a meal.","ultime":"2012-12-19","dir":"mp3\/NC\/","parashah":"Vayeira","id":"309"},{"number":null,"filename":"Vayeira 3.mp3","title":"Vayeira 3","description":" Chp. 18 verses 9 - 25: The angel\/arab blesses Sara with a son and she laughs. Hashem tells Awraham that he will have a son, and questions Sara's laughter. Awraham confronts her aboud her laughter and she denies it. The guests leave and Hashem appears to Awraham to inform him of the destruction of Sodom and its inhabitants. Awraham begins his plea for the cities. ","ultime":"2013-01-02","dir":"mp3\/NC\/","parashah":"Vayeira","id":"310"},{"number":null,"filename":"Vayeira 4.mp3","title":"Vayeira 4","description":"Chp. 18 verse 26 - Chp. 19 verse 11: Continues with Avrahams impassioned plea to Hashem on behalf of the people of Sodom. The chp. ends with him accepting G-d's decision and returning to his place. Chp. 18 begins with the angels coming to Sodom and being invited to the home of Lot. While they are there the people of the city surround his house and demand that he give his guests to them for immoral purposes. Lot goes out and tries to reasson with them but to no avail. He is pulled back into the house by the angels who proceed to blind all the people who are surrounding his house.  ","ultime":"2013-01-09","dir":"mp3\/NC\/","parashah":"Vayeira","id":"311"},{"number":null,"filename":"Vayeira 5.mp3","title":"Vayeira 5","description":"Chp. 19 verses 12 - 38: Continues with the story of Lot and his family as they are being saved by the angels from the destruction of Sodom. After they leave the city the angel of G-d destroy the cities. His wife looks back and is turned into a pillar of salt. Then he and his two daughters hide in a mountain cave. His daughters thinking that they are the only survivors in the world get their father drunk and have relations with him. They give birth to two sons Moav and Amon. ","ultime":"2013-01-23","dir":"mp3\/NC\/","parashah":"Vayeira","id":"312"},{"number":null,"filename":"Vayeira 6.mp3","title":"Vayeira 6","description":"Chp. 19 verse 1 - chp. 20 verse 6: Avraham and Sawra go to Gerar, where he experiences another of his ten tests. Sawra is abducted by Avimelech the king of Gerar. The king is warned by Hashem to release her. His whole household is plagued because of her. The king releases her with lavish gifts. Avraham prays for him, and then he and his household are cured. Chp. 20, begins with Hsshem remembering Sawra and she gives birth to Yitzhok. Avraham who is one hundred years old, circumcises him on the eighth day of his birth and names him Yitzhok.  ","ultime":"2013-01-30","dir":"mp3\/NC\/","parashah":"Vayeira","id":"313"},{"number":null,"filename":"Vayeira 7.mp3","title":"Vayeira 7","description":"Chp. 21 verses 6 - 34: Continues with the weaning of Yitzhok. Next the test of sending away Yishmael. Chp. ends with the treaty with Avimelech. ","ultime":"2013-02-06","dir":"mp3\/NC\/","parashah":"Vayeira","id":"314"},{"number":null,"filename":"Vayeira 8.mp3","title":"Vayeira 8","description":"Chp. 22 verses 1 - 5: Overview, the request of Hashem to Avraham to bring Yitzhok up as a sacrifice. They reach the mountain and are about to ascend. ","ultime":"2013-02-13","dir":"mp3\/NC\/","parashah":"Vayeira","id":"315"},{"number":null,"filename":"Vayeira 9.mp3","title":"Vayeira 9","description":"Chp. 22 verses 6 - 24: Continues with the \" Binding of Yitzhok.\" Avraham is told not to sacrifice Yitzhok, that Hashem only wanted him brought up on the alter. Avraham then brings a ram in lieu of Yirzhok. They then return to Be'er Sheva. The portion ends with the birth of Rivkah. ","ultime":"2013-02-20","dir":"mp3\/NC\/","parashah":"Vayeira","id":"316"},{"number":null,"filename":"Chayei Sarah 1.mp3","title":"Chayei Sarah 1","description":"Chp. 23 verses 1-7: Introduction, Sara dies in Hebron and Avraham begins the funeral arrangements to bury her.  ","ultime":"2013-02-27","dir":"mp3\/NC\/","parashah":"Chayei Sarah","id":"317"},{"number":null,"filename":"Chayei Sarah 2.mp3","title":"Chayei Sarah 2","description":"Chp. 23 verse 8 - Chp. 24 verse 3: Avraham purchases the Cave of the Macpelah and buries Sarah. Chp. 24 Avraham gives Eliezar his servant the mission of finding a wife for Yitzhok. ","ultime":"2013-03-06","dir":"mp3\/NC\/","parashah":"Chayei Sarah","id":"318"},{"number":null,"filename":"Chayei Sarah 3.mp3","title":"Chayei Sarah 3","description":"Chp. 24 verses 4 - 21: Eliezer the servant of Avraham sets out on his mission to find a wife for Yitzhok. He stops at a well and prays to Hashem to show him the girl who would be chosen to be Yitzhok's wife. He proposes certain test to prove she would be the one. Rivkah appears immediately and begins to fulfill all of the tests that he had proposed to Hashem\/ ","ultime":"2013-03-13","dir":"mp3\/NC\/","parashah":"Chayei Sarah","id":"319"},{"number":null,"filename":"Chayei Sarah 4.mp3","title":"Chayei Sarah 4","description":"Chp. 24 verses 21 - 49: Continues with the story of Eliezar finding a wife for Yitzhok. ","ultime":"2013-03-20","dir":"mp3\/NC\/","parashah":"Chayei Sarah","id":"320"},{"number":null,"filename":"Chayei Sarah 5.mp3","title":"Chayei Sarah 5","description":"Chp. 24 verses 50 -67: Continues with the story of Eliezar bringing Rivkah to Yitzhok as a wife. ","ultime":"2013-04-03","dir":"mp3\/NC\/","parashah":"Chayei Sarah","id":"321"},{"number":null,"filename":"Chayei Sarah 6.mp3","title":"Chayei Sarah 6","description":"Chp. 25 verses 1 - 18: Avraham marries Keturah, she bears him six sons. He sends them to the east with gifts. However, to Yitzhok he leaves all that he owns. He dies at the age of 175. He is buried by Yitzhok and Yishmael in the Machpelah with Sawra. Continues with the genealogy of Yishmael, and his death at the age of 137.  ","ultime":"2013-04-10","dir":"mp3\/NC\/","parashah":"Chayei Sarah","id":"322"},{"number":null,"filename":"Toldot 1.mp3","title":"Toldot 1","description":"Chp. 25 verses 19 - 23: Introduction, begins with the genealogy of Yitzhok. He marries Rivkah. She is barren, they pray to Hashem and she becomes pregnant. She finds the pregnancy difficult and so she goes to prophet to inquire about her situation. He tells her that she is pregnant with twins, and that the older one would serve the younger one.  ","ultime":"2013-04-17","dir":"mp3\/NC\/","parashah":"Toldot","id":"323"},{"number":null,"filename":"Toldot 2.mp3","title":"Toldot 2","description":"Chp. 25 verse 24 - 34: The birth of Esua and Yaakov. Esua sells his firstborn birthright to Yaakov for a bowl of lentils. ","ultime":"2013-04-24","dir":"mp3\/NC\/","parashah":"Toldot","id":"324"},{"number":null,"filename":"Toldot 3.mp3","title":"Toldot 3","description":"Chp. 26 verses 1 - 22: There is a famine in the land. Yitzhok moves to Gerar the land of the Philistines. The people are jealous of his success and they ask him to leave. He re-digs the same wells that his father dug but there is contention. He then digs a third well which no one contends with.  ","ultime":"2013-05-01","dir":"mp3\/NC\/","parashah":"Toldot","id":"325"},{"number":null,"filename":"Toldot 4.mp3","title":"Toldot 4","description":"Chp. 26 verse 23 - Chp. 27 verse 10: Yitzhok makes a treaty with a king. Esau marries and Yitzhok prepares to bless Eaau.","ultime":"2013-05-12","dir":"mp3\/NC\/","parashah":"Toldot","id":"326"},{"number":null,"filename":"Toldot 5.mp3","title":"Toldot 5","description":"Chp. 27 verses 11 - 27: Based on his Mother's insistence Yaakov puts on Esau's clothing. He places goat's hair on his arms and takes the food that his mother has prepared to his father. His father is not sure who is standing in front of him since the voice is the voice of Yaakov but the hands are those of Esau. Yitzhok eats the food and prepares to bless the son who is standing before him.(Yaakov)","ultime":"2013-05-22","dir":"mp3\/NC\/","parashah":"Toldot","id":"327"},{"number":null,"filename":"Toldot 6.mp3","title":"Toldot 6","description":"Chp. 27 verses 28 - 38: Yitzhok unwittingly blesses Yaakov with the firstborn blessing. Yaakov exists just before Esau enters with the food for his father. Esau cries bitterly when his realizes that Yaakov had duped him and taken the blessing. He asks his father for another blessing but Yitzhok tells him that there is no other blessing. He refuses to take no for an answer and finally his father tells him that he will bless him.  ","ultime":"2013-05-29","dir":"mp3\/NC\/","parashah":"Toldot","id":"328"},{"number":null,"filename":"Toldot 7.mp3","title":"Toldot 7","description":"Chp. 27 verse 39 -46 Chp. 28 verses 1 -9: Esau receives his blessing from his father. Rivkah warns Yaakov about Esau's intention to kill him. She tells him to flee to her brother Lavan. Chp. 28, Yitzhok tells Yaakov to go to Padan Aram and to take a wife from the daughters of Lavan. Esau sees what his father told Yaakov so he too takes a new wife from the daughters of Yishmael.","ultime":"2013-06-05","dir":"mp3\/NC\/","parashah":"Toldot","id":"329"},{"number":"2","filename":"Vayeitzei 2.mp3","title":"Vayeitzei 2","description":"Chp. 28 verses 12 - 15: Yaakov has a dream in which Hashem promises to protect him and his descendants and to give him the land that was promised to his grandfather. Also to return him back to the land.   ","ultime":"2013-06-19","dir":"mp3\/NC\/","parashah":"Vayeitzei","id":"330"},{"number":"3","filename":"Vayeitzei 3.mp3","title":"Vayeitzei 3","description":"Chp. 28 verses 16 -22: Yaakov wakes up from his dream and realizes that the place he slept was the house of G-d, and that he had just received a prophecy. He anoints the stone and calls the place Luz. He then asks Hashem to give him \"food to eat and clothes to wear\" and to return him back to his father's house in peace. In return he promises to give one fifth of all that he has to G-d. ","ultime":"2013-06-26","dir":"mp3\/NC\/","parashah":"Vayeitzei","id":"331"},{"number":"7","filename":"Vayeitzei 7.mp3","title":"Vayeitzei 7","description":"Chp. 30 verses 1 - 21: Rachel sees that she is not bearing any children so she gives Yaakov her handmaiden Bilhah as a wife. She bears him two sons. Leah who has also stopped having children gives Yaakov her handmaiden Zilpah for a wife and she bears two more sons for him. Then Leah gives the \"mandrakes\" that her son had given her to Rachel in exchange for a marital night with Yaakov and she gives birth to Issacher. She then bears the tenth son to Yaakov, Zebulun. After that she gives birth to a daughter, Dinah.  ","ultime":"2013-08-07","dir":"mp3\/NC\/","parashah":"Vayeitzei","id":"332"},{"number":"4","filename":"Vayeitzei 4.mp3","title":"Vayeitzei 4","description":"Chp. 29 verse 1 -12: Yaalov travels to Charan. He comes to a well where three Shepherds are waiting to water their sheep. They are waiting for the other shepherds to roll the stone off the well so that they can all water their sheep. In the meantime Rachel comes and he kisses her and he cries. Rachel runs to tell her father that Yaakov has arrived.  ","ultime":"2013-07-03","dir":"mp3\/NC\/","parashah":"Vayeitzei","id":"333"},{"number":"1","filename":"Vayeitzei 1.mp3","title":"Vayeitzei 1","description":"Chp. 28 verse 10 & 11: Introduction, Yaakov leaves Beer Sheva and goes to Charan. He reaches the place of the Temple and sleeps there because the sun sets early. He takes 12 stones from the area to protect his head.","ultime":"2013-06-12","dir":"mp3\/NC\/","parashah":"Vayeitzei","id":"334"},{"number":"5","filename":"Vayeitzei 5.mp3","title":"Vayeitzei 5","description":"Chp. 29 verses 13 - 25: Yaakov meets Lavan. Lavan hires Yaakov to tend his sheep and agrees to work for seven years to marry Rachel. Lavan tricks him and gives him Leah his older daughter instead. The night after the wedding Yaakov realizes that he has been duped and confronts Lavan and asks him, why he tricked him? ","ultime":"2013-07-10","dir":"mp3\/NC\/","parashah":"Vayeitzei","id":"335"},{"number":"6","filename":"Vayeitzei 6.mp3","title":"Vayeitzei 6","description":"Chp. 29 verses 26 - 35: Lavan explains to Yaakov why he gave him Leah instead of Rachel. He agrees to work another seven years for Rachel. He marries her seven days later. Hashem sees that Leah is not loved and gives her four sons, while Rachel remains barren. ","ultime":"2013-08-09","dir":"mp3\/NC\/","parashah":"Vayeitzei","id":"336"},{"number":"8","filename":"Vayeitzei 8.mp3","title":"Vayeitzei 8","description":"Ch.30 Verses 22-43: Rochel gives birth to Yosef, and Lavan strikes a deal with Yaakov to tend his sheep for profit. Lavan tries to cheat Yaakov many times but Hashem protects him and he becomes very wealthy in spite of Lavan's deception. ","ultime":"2013-08-14","dir":"mp3\/NC\/","parashah":"Vayeitzei","id":"337"},{"number":"9","filename":"Vayeitzei 9.mp3","title":"Vayeitzei 9","description":"Chp. 31 verses 1 - 35: Yaakov realizes that his relationship with Lavan has deteriorated. He had his wives come out to the field and he informs them that Hashem has told him to return to the land of his father. They agree, and he leaves without Lavan's knowledge. Rachel takes her father's \"terafim\" with her. Lavan hearing that Yaakov has fled, chases after him. He is visited by G-d in a dream and told not speak neither good nor bad to Yaakov. Lavan reaches Yaakov's camp and rebukes him for leaving without saying good bye, and asks why he had stolen his gods? Yaakov tells him that \"with whomever you find your gods, he shall not live.\" He searches and finds nothing. ","ultime":"2013-08-16","dir":"mp3\/NC\/","parashah":"Vayeitzei","id":"338"},{"number":"10","filename":"Vayeitzei 10.mp3","title":"Vayeitzei 10","description":"Chp. 31 verse 36 - 54 Chp. 32 verse 1 - 3: Yaakov expresses his anger that Lavan has searched all of his possessions. They decide to make a treaty between them at \"Galaid.\" They sit down to a meal, and Lavan spends the night. Chp. 32, Lavan gets up early in the morning and goes back to his place. Yaakov leaves and he is met by the angels of Hashem. ","ultime":"2013-08-21","dir":"mp3\/NC\/","parashah":"Vayeitzei","id":"339"},{"number":"1","filename":"Vayishlach 1.mp3","title":"Vayishlach 1","description":"Chp. 32 verses 4 - 8: Introduction, Yaakov sends messengers to Esau. He is told that he is coming to meet him with four hundred men. He is afraid and distressed by the news and he divides all that he has into two camps. ","ultime":"2013-08-28","dir":"mp3\/NC\/","parashah":"Vayishlach","id":"340"},{"number":"2","filename":"Vayishlach 2.mp3","title":"Vayishlach 2","description":"Chp. 32 verses 9 - 13: Yaakov divides his possessions into two camps. Then he prays to Hashem to save him from his brother Esau.  ","ultime":"2013-09-11","dir":"mp3\/NC\/","parashah":"Vayishlach","id":"341"},{"number":"3","filename":"Vayishlach 3.mp3","title":"Vayishlach 3","description":"Chp. 32 verses 14 - 25: Yaakov separates the animals that he will send to Esau, and tells his servants exactly what to say to his brother. He moves his family and possessions across the stream of Jabbok. He returns for some small jars that he had forgotten and there he encounters a man that he wrestles with.  ","ultime":"2013-10-03","dir":"mp3\/NC\/","parashah":"Vayishlach","id":"342"},{"number":null,"filename":"Serving%20Hashem%20with%20Song%20-%20Marty%20Goodman.mp3","title":"Interview With Rabbi Finman","description":"","ultime":"2013-10-03","dir":"mp3\/","parashah":"Radio Show","id":"343"},{"number":"4","filename":"Vayishlach 4.mp3","title":"Vayishlach 4","description":"Chp. 32 verses 25 - 33: Yaakov wrestles with Esau's angel and is victorious. However, the angel is able to injure him in his thigh. He will not allow the angel to leave until his receives a blessing. G-d makes the sun rise early so that Yaakov can be healed from his injury. To commemorate this event Hashem commands us not to eat the \"gid ha nashaw\" the sciatic nerve.  ","ultime":"2013-10-09","dir":"mp3\/NC\/","parashah":"Vayishlach","id":"344"},{"number":"5","filename":"Vayishlach 5.mp3","title":"Vayishlach 5","description":"Chp. 33 verses 1 - 20: Yaakov and Esau finally meet and they part in peace. ","ultime":"2013-10-16","dir":"mp3\/NC\/","parashah":"Vayishlach","id":"345"},{"number":"6","filename":"Vayishlach 6.mp3","title":"Vayishlach 6","description":"Chp. 34 verses 1 - 24: Dinah the daughter of Yaakov is raped by Shechem the prince of the city. He falls in love with her and wants to marry her. He and his father approach Yaakov and his sons asking for their permission. They say that they will only agree on the condition that they and all the male inhabitants of the city circumcise themselves. They agree, and do so immediately. They then convince all the men in the city to do the same.  ","ultime":"2013-10-23","dir":"mp3\/NC\/","parashah":"Vayishlach","id":"346"},{"number":"7","filename":"Vayishlach 7.mp3","title":"Vayishlach 7","description":"Chp. 34 verse 24 - 31 Chp. 35 verses 1 - 13: All the men of the city of Shechem allow themselves to be circumcised. On the third day after their circumcision Shimon and Levi kill out Shem, Chamor, and all the men. They take Dinah and all the brothers loot the city. Yaakov criticizes them for their act. Chp. 35, Hashem tells Yaakov to build Him an alter. He tells his household to purify themselves. He goes to Bais El and he builds an alter there and names it for the place. Devorah dies there an he buries her under the oak. Hashem gives him a new name, Yisrael, and once again promises him the land.  ","ultime":"2013-10-30","dir":"mp3\/NC\/","parashah":"Vayishlach","id":"347"},{"number":"8","filename":"Vayishlach 8.mp3","title":"Vayishlach 8","description":"Chp. 35 verses 14 - 31 chp. 36 verse 1 - 43: Rachel gives birth to Binyamin. She dies in childbirth and is buried outside of Bethlehem. Yaakov places a headstone on her grave. Ruevain moves the bed of his father. Torah lists the twelve sons of Yaakov. Yitzhok dies at the age of 180 and is buried by Esau and Yaakov. Chp. 36 lists the genealogy of the descendants of Esau.  ","ultime":"2013-11-06","dir":"mp3\/NC\/","parashah":"Vayishlach","id":"348"},{"number":"1","filename":"Vayeishev 1.mp3","title":"Vayeishev 1","description":"Chp. 37 verses 1 - 3: Introduction, the portion begins with an introduction to Yoseph who is seventeen years old. He is a shepherd with his brothers, but he brings evil reports about them to his father. Yisrael, loves him more than any of his sons, and he gives him a coat of many colors.  ","ultime":"2013-11-13","dir":"mp3\/NC\/","parashah":"Vayeishev","id":"349"},{"number":"2","filename":"Vayeishev 2.mp3","title":"Vayeishev 2","description":"Chp. 37 verses 4 - 12: Yosef has a dream and he tells it to his brothers. This causes them to hate him even more. He has a second dream that he tells to his father and his brothers. This dream brings out the brothers jealousy towards him. His father gets angry at him but at the same time anticipates the moment that it would come true. The brothers go to Shechem to tend their father's sheep. ","ultime":"2013-11-20","dir":"mp3\/NC\/","parashah":"Vayeishev","id":"350"},{"number":"3","filename":"Vayeishev 3.mp3","title":"Vayeishev 3","description":"Chp. 37 verses 13 -22: Yaakov sends Yosef to check on his brothers and the sheep in Schechem. He finds them in Dasan. They throw him in a pit with snakes and scorpions. Ruevain convinces them not to kill him and throw him into the pit, thinking that he would come back later and save him.","ultime":"2013-11-27","dir":"mp3\/NC\/","parashah":"Vayeishev","id":"351"},{"number":"4","filename":"Vayeishev 4.mp3","title":"Vayeishev 4","description":"Chp. 37 verses 23 - 36: The brothers throw Yosef into a pit and then decide to sell him to the Yishmalites who would sell him in Egypt. They dip his coat of many colors into the blood of a goat and present it to Yaakov asking him if he recognized it or not. He grieved for the loss of his favorite son and would not accept any consolation.  ","ultime":"2013-12-04","dir":"mp3\/NC\/","parashah":"Vayeishev","id":"352"},{"number":"1","filename":"shalom aleichem.MP3","title":"Shalom Aleichem","description":"","ultime":"2012-08-01","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"353"},{"number":"2","filename":"Aishes Chayil.mp3","title":"Aishes Chayil","description":"","ultime":"2012-08-01","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"354"},{"number":"3","filename":"mizmor l'dovid.MP3","title":"Mizmor L'Dovid","description":"","ultime":"2012-08-01","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"355"},{"number":"4","filename":"kiddush.MP3","title":"Kiddush","description":"","ultime":"2012-08-01","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"356"},{"number":"5","filename":"trup-haftorah.MP3","title":"Haftorah Trop","description":"","ultime":"2012-08-01","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"357"},{"number":"5","filename":"Vayeishev 5.mp3","title":"Vayeishev 5","description":"Chp. 38 verses 1 - 25: Yehudah marries and he has three children. Two of them die while being married to Tamar. He tells her that she should wait for the third son to become older and then he would marry her, but it was only a ruse. Yehudah's wife dies and he goes to Timna to shear his sheep. Tamar disguises herself as a harlot, waits for him on the road, and she seduces him. She takes three items from him as surety for payment of her services. He sends his friend to pay the debt and retrieve his things, but no harlot can be found. Tamar conceives twins and he wants to put her to death because of her harlotry. She sends him the three items that she had taken for collateral and says that she is pregnant from the man who owns these. ","ultime":"2013-12-11","dir":"mp3\/NC\/","parashah":"Vayeishev","id":"358"},{"number":"6","filename":"Vayeishev 6.mp3","title":"Vayeishev 6","description":"Chp. 38 verses 26 - 30 Chp. 39 verses 1 - 23: Continues with Yehuda's admission that he was the one who had impregnated Tamar. She gives birth to twins. Chp. 39 returns to the story of Yosef being sold into slavery. He is successful in his masters house and Hashem is with him in all that he does. His masters wife tries to seduce him and when he refuses she accuses him of rape. He is sent to the royal prison. Hashem is with him even there and he finds favor in the warden's eyes and he is in charge of everything that goes on in the prison. ","ultime":"2013-12-18","dir":"mp3\/NC\/","parashah":"Vayeishev","id":"359"},{"number":"7","filename":"Vayeishev 7.mp3","title":"Vayeishev 7","description":"Chp. 40 verses 1 - 23: The chief butler and baker are put into the same prison with Yosef. They both have a dream and he interprets their dreams. He tells the baker that he will be hung and the butler that he will be reinstated, and his prediction comes true. He asks the butler to remember him to Pharoah but he forgets. ","ultime":"2013-12-25","dir":"mp3\/NC\/","parashah":"Vayeishev","id":"360"},{"number":"0","filename":"Kaddish.mp3","title":"Kaddish","description":"mourners kaddish","ultime":"2013-12-27","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"361"},{"number":"0","filename":"kaddish d'rabbanim.mp3","title":"kaddish d'rabbanim","description":"kaddish d'rabbanim","ultime":"2013-12-27","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"362"},{"number":"1","filename":"Mikeitz 1.mp3","title":"Mikeitz 1","description":"Chap. 41 verses 1 - 13: Introduction, Pharaoh has two dreams and no one is able to interpret them to his satisfaction. The butler finally remembers Yosef to Pharaoh as he promised.","ultime":"2014-01-08","dir":"mp3\/NC\/","parashah":"Mikeitz","id":"363"},{"number":"2","filename":"Mikeitz 2.mp3","title":"Mikeitz 2","description":"Chp. 41 verses 14 - 41: Yosef interprets Pharaoh's dream. Pharaoh appoints him to the position of viceroy of Egypt, since he sees in him the spirit of G-d.    ","ultime":"2014-01-15","dir":"mp3\/NC\/","parashah":"Mikeitz","id":"364"},{"number":"3","filename":"Mikeitz 3.mp3","title":"Mikeitz 3","description":"Chp. 41 verses 42 - 57: Pharaoh appoints Yosef as his viceroy. He changes his name and gives him a wife. She bears him two sons. The seven years of plenty come and Yosef stores up all the grain in Egypt. Then the years of famine begin and the people feel it immediately. Their grain rots but his remains edible. He opens up the storehouses and feeds Egypt and the world. ","ultime":"2014-01-22","dir":"mp3\/NC\/","parashah":"Mikeitz","id":"365"},{"number":"4","filename":"Mikeitz 4.mp3","title":"Mikeitz 4","description":"Chp. 42 verses 1 - 23: Yaakov sends 10 of his sons to Egypt to buy grain. They go there with the intent of locating Yosef and freeing him. Yosef, the viceroy recognizes them but they do not recognize him. He accuses them of being spies and puts them in jail for three days. He decides to free all but one of them on the condition that they return to Egypt with their youngest brother to prove their innocence. Seeing that the viceroy had re evaluated his decision made them re look their lack of compassion for Yosef when they sold him. ","ultime":"2014-01-29","dir":"mp3\/NC\/","parashah":"Mikeitz","id":"366"},{"number":"0","filename":"shabbos evening services.mp3","title":"shabbos evening services","description":"shabbos evening services","ultime":"2014-02-03","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"367"},{"number":"0","filename":"shabbos morning services.mp3","title":"shabbos morning services","description":"shabbos morning services","ultime":"2014-02-03","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"368"},{"number":"0","filename":"shabbos musaf services.mp3","title":"shabbos musaf services","description":"shabbos musaf services","ultime":"2014-02-03","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"369"},{"number":"0","filename":"shabbos afternoon prayer.mp3","title":"shabbos afternoon prayer","description":"shabbos afternoon services","ultime":"2014-02-04","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"370"},{"number":"0","filename":"weekday pesukai d'zimra.mp3","title":"weekday pesukai d'zimra","description":"weekday pesukai d'zimra service","ultime":"2014-02-04","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"371"},{"number":"0","filename":"weekday morning prayer.mp3","title":"weekday morning prayer","description":" weekday morning prayer service","ultime":"2014-02-04","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"372"},{"number":"0","filename":"weekday afternoon & evening prayer.mp3","title":"weekday afternoon & evening prayer","description":"weekday afternoon & evening prayer service","ultime":"2014-02-04","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"373"},{"number":"5","filename":"Mikeitz 5.mp3","title":"Mikeitz 5","description":"Chp. 42 verses 24 - 38: Yosef sends the brothers home to Canaan with sacks of grain. He keeps Shimon as a prisoner until they return with Binyamin, however he releases him as soon as they leave. On the way home Levi finds the money that he payed for his grain in his sack. The brothers are concerned. They tell Yaakov all that happened in Egypt; about Shimon's incarceration and that they would have to bring Binyamin down to Egypt. They all find their money in their sacks and they are frightened. Ruevain guarantees to bring back Binyamin and he offers the lives of two of his sons as collateral. Yaakov refuses to send him and bemoans his fate.     ","ultime":"2014-02-05","dir":"mp3\/NC\/","parashah":"Mikeitz","id":"374"},{"number":"6","filename":"Mikeitz 6.mp3","title":"Mikeitz 6","description":"Chp. 43 verses 1 -24: The famine continues and Yaakov is forced to send his sons back to Egypt for food. Yehuda tells his father that he will personally guarantee Binyamin's safety. Yaakov sends his 11 sons with money and gifts for the viceroy. They come to Egypt and Yosef sees Binyamin. He has them taken to his house for a meal. They go but are very uneasy thinking that he may only want to put them back in prison. Yosef's attendant assures them that everything was fine and he brings out Shimon. They follow the attendant into the house and he gives them water and food for their animals. ","ultime":"2014-02-12","dir":"mp3\/NC\/","parashah":"Mikeitz","id":"375"},{"number":"7","filename":"Mikeitz 7.mp3","title":"Mikeitz 7","description":"Chp. 43 verses 25 -34 chp. 44 verses 1 - 17;  The brothers prepare for their meal with Yosef. He sees Binyamin and is moved to tears. He eats and drinks with his brothers. Chp. 44 He has his attendant place his silver cup in the sack of Binyamin. The brothers leave with their sacks filled with grain but are overtaken by Yosef's attendant who accuses them of stealing his masters cup. He searches and finds it in the sack of Binyamin. They all go back to the viceroy and he tells them that they are all free to go but Binyamin will stay as his servant for the theft. ","ultime":"2014-02-19","dir":"mp3\/NC\/","parashah":"Mikeitz","id":"376"},{"number":"0","filename":"shabbos pesukai d'zimra.mp3","title":"shabbos pesukai d'zimra","description":"the shabbos pesukai d'zimra prayer","ultime":"2014-02-19","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"377"},{"number":"0","filename":"festival morning prayer .mp3","title":"festival morning prayer ","description":"the morning shacharis prayer for the festivals","ultime":"2014-02-19","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"378"},{"number":"0","filename":"Hallel.mp3","title":"Hallel","description":"the complete hallel","ultime":"2014-02-19","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"379"},{"number":"0","filename":"festival evening prayer.mp3","title":"festival evening prayer","description":"the maariv evening prayer for the festivals","ultime":"2014-02-19","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"380"},{"number":"0","filename":"festival musef prayer.mp3","title":"festival musef prayer","description":"the musef prayer for the festivals","ultime":"2014-02-19","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"381"},{"number":"0","filename":"blessing the new moon.mp3","title":"blessing the new moon","description":"blessing the new moon birchas ha chodesh","ultime":"2014-02-19","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"382"},{"number":"0","filename":"shabbos rosh chodesh musef .mp3","title":"shabbos rosh chodesh musef ","description":"the musef prayer for shabbos rosh chodesh","ultime":"2014-02-19","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"383"},{"number":"1","filename":"Vayigash 1.mp3","title":"Vayigash 1","description":"Chp. 44 verses 18 - 34: Yehudah makes an impassioned plea to the viceroy to save Binyamin from servitude. He expresses his concern that leaving Binyamin in Eygpt would kill his elderly father. He goes so far as to offer himself as a slave instead of his younger brother. ","ultime":"2014-03-05","dir":"mp3\/NC\/","parashah":"Vayigash","id":"384"},{"number":"2","filename":"Vayigash 2.mp3","title":"Vayigash 2","description":"Chp. 45 verses 1 - 11: Yosef reveals himself to his brothers and asks them if his father is still alive. They are terrified by his appearance and they back away. He assures them that he means them no harm and that all that had transpired was orchestrated by Hashem. He instructs them on what to say to his father and that they should bring him and all their possessions down to Egypt where they will live close to him and he would support them through the five remaining years of the famine.  ","ultime":"2014-03-12","dir":"mp3\/NC\/","parashah":"Vayigash","id":"385"},{"number":"3","filename":"Vayigash 3.mp3","title":"Vayigash 3","description":"chp. 45 verses 12 - 28: Yosef instructs his brothers on what to tell his father. He hugs Binyamin and the they cry on each others shoulders. He then kisses his brothers and cries with them. Pharaoh and the people are happy to hear that Yosef and his brothers have been re united. Pharaoh commands Yosef to send wagons to bring his father and all the family to live in Egypt. The brothers return home and they tell Yaakov all that Yosef had said, but he did not believe them. However, when he saw the wagons he realized that Yosef was alive and his spirit was revived and he wanted to go down to Egypt and see Yosef before he died.","ultime":"2014-03-26","dir":"mp3\/NC\/","parashah":"Vayigash","id":"386"},{"number":"0","filename":"haftorah blessings.mp3","title":"haftorah blessings","description":"the blessings before and after saying a haftorah","ultime":"2014-03-26","dir":"mp3\/chazanus\/","parashah":"Leading Services","id":"387"},{"number":"4","filename":"Vayigash 4.mp3","title":"Vayigash 4","description":"Chp. 46 verses 1 - 27: Yaakov visits B'eer Sheva on his way to Egypt. He brings sacrifices to Hashem, who comes to him in a vision at night and tells him that he will be with him and his descendents and that they will be a great nation. He promises him that Yosef will close his eyes when he dies and that he will be buried in the land of Canaan. Yaakov leaves with his whole family of seventy individuals. The Torah then lists them by their mothers.","ultime":"2014-04-02","dir":"mp3\/NC\/","parashah":"Vayigash","id":"388"},{"number":"5","filename":"Vayigash 5.mp3","title":"Vayigash 5","description":"Chp. 46 verses 28 - 34 Chp. 47 verses 1 - 27: Yosef harnesses his own chariot, goes out to greet his father, and crys on his neck. He tells his family that he is going to tell Pharaoh that they have arrived, and that they should tell him that they are shepherds. Chp. 47, Yosef takes five of the weakest brothers to meet Pharaoh. He is then introduced to Yaakov who blesses him that the Nile should rise whenever he approached it. With Yaakov's arrival the famine ceased. The people were forced during the first two years of the famine to sell everything they owned to yosef. Now that Yaakov came they needed seed and so they sold themselves and their land to him. He made them sharecroppers to Pharaoh taking 1\/5 of their produce, and the people were given to him. He moved the people from one city to another so that his family wouldn't feel like strangers. They dwelt in Goshen and there they were fruitful and multiplied.   ","ultime":"2014-04-09","dir":"mp3\/NC\/","parashah":"Vayigash","id":"389"},{"number":"1","filename":"Vayechi 1.mp3","title":"Vayechi 1","description":"Chp. 47 verses 28 - 31: Yaakov lives in the land of Egypt for seventeen years. He will live to the age of 147. Before he dies he calls for Yosef and asks him to take an oath that when he dies he will bury him in the land of Canaan in the Cave of the Macpelah. Yosef agrees to do fulfill his father's request. Yaakov asks him to swear to him and he takes an oath.   ","ultime":"2014-04-23","dir":"mp3\/NC\/","parashah":"Vayechi","id":"390"},{"number":"2","filename":"Vayechi 2.mp3","title":"Vayechi 2","description":"Chp. 48 verses 1 - 9: Yosef is told that his father is on his deathbed. He takes his two sons with him so that his father can bless them before he dies. He tells Yosef that his two sons would each be counted as one of the tribes of Israel, just as Ruevain and Shimon. Yaakov then explains why he buried Rachel on the road to Bethlehem. Yaakov then sees the sons of Yosef and he asks who they are? Yosef assures him that they are his children. Yaakov then asks him to bring then to him so that he can bless them.   ","ultime":"2014-04-30","dir":"mp3\/NC\/","parashah":"Vayechi","id":"391"},{"number":"3","filename":"Vayechi 3.mp3","title":"Vayechi 3","description":"Chp.48 verses 10 -20: Yosef places his two sons between the knees of his father so that he can bless them. He places Manasseh, the first born, on his right and Ephraim, youngest, on his left. Yaakov crosses his hands so that his right hand in on the youngest and his left hand on the eldest. Yosef protests but Yaakov insists that he knows what he is doing. He blesses his grandsons with the famous blessing used to this day to bless Jewish boys. ","ultime":"2014-05-07","dir":"mp3\/NC\/","parashah":"Vayechi","id":"392"},{"number":"4","filename":"Vayechi 4.mp3","title":"Vayechi 4","description":"Chp. 48 verses 21 & 22. Chp. 49 verses 1 - 4: Yaakov tells Yosef that he is going to die, but that Hashem would be with them and return them to the land of their fathers. He then gives him Shechem as an inheritance over and above that of his brothers. Chp. 49 Yaakov gathers his sons and wants to tell them about the end of time but the Divinity of G-d leaves him. He then begins to bless his sons. He begins with the eldest Reuvain, whom he criticizes as being unstable as water.  ","ultime":"2014-05-14","dir":"mp3\/NC\/","parashah":"Vayechi","id":"393"},{"number":"5","filename":"Vayechi 5.mp3","title":"Vayechi 5","description":"Chp. 49 verses 5 - 12: Yaakov continues with Shimon and Levi,he curses their anger. Then he turns to Yehudah who starts to leave thinking his father would criticize him about his affair with his daughter-in-law. Yaakov sensing his concern changes the direction of his words and Blesses Yehudah with words of praise and promise. He would continue to bless the rest of his sons without any words of condemnation. ","ultime":"2014-05-20","dir":"mp3\/NC\/","parashah":"Vayechi","id":"394"},{"number":"6","filename":"Vayechi 6.mp3","title":"Vayechi 6","description":"Chp. 49 verses 13 - 18: Yaakov continues with the blessing of Zevulun, who were the businessman who traveled on the seas. They supported their brother Yisaachar who were the Torah scholars. They were blessed after Zevulun to be successful in their learning and their service to Hashem. Next he blessed Dan whom he referred to as a \"serpent on the road.\" His blessing was an allusion to Samson who was from the tribe of Dan and would judge them for 20 years. He finishes with a prayer for the generations,\" for your salvation I have waited O L-rd.\"","ultime":"2014-05-28","dir":"mp3\/NC\/","parashah":"Vayechi","id":"395"},{"number":"7","filename":"Vayechi 7.mp3","title":"Vayechi 7","description":"Chp. 49 verses 19 - 28: Continues with Yaakov blessing his sons. He blesses Gad, Asher, and Naphtali with short blessings. However, with Yosef he showers him with special blessings and praise. He concludes with the youngest son Binyamin. The Torah concludes his blessing with the words that \"he blessed them,\" to elude to the fact that they were all included in each others blessings. ","ultime":"2014-06-11","dir":"mp3\/NC\/","parashah":"Vayechi","id":"396"},{"number":"8","filename":"Vayechi 8.mp3","title":"Vayechi 8","description":"Chp. 48 verses 29 -33 Chp. 50 verses 1 - 13: Yaakov finishes blessing his sons. He instructs them once again to bury him in the Cave of the Machpelah in the land of Canaan. He expires and is gathered to his people. Chp. 50 Yosef has his father embalmed for forty days and then the Egyptians mourn for him for thirty days. He then asks Pharaoh for permission to take his father to Canaan to be buried. Pharaoh agrees and he and his brothers and families accompanied by Egyptian dignitaries and an army take his father to the Machpelah. They mourn for their father for seven days at Abel-mizraim. Then they carry him to the cave of the Machpelah for burial. ","ultime":"2014-06-18","dir":"mp3\/NC\/","parashah":"Vayechi","id":"397"},{"number":"9","filename":"Vayechi 9.mp3","title":"Vayechi 9","description":"Chp. 50 verses 14 -26: Yosef and his brothers return to Egypt after burying their father. The brothers detect a difference in Yosef attitude towards them. They are concerned that now that Yaakov was dead that Yosef would exact his revenge on them or their children for selling him. They send a messenger to tell him that their father on his deathbed had instructed them to say to him that he should forgive them. He assures them that he will continue to support them and their children. Yosef lives to see great grandchildren. He is the first of the brothers  to die. Before he dies he makes all the children of Israel swear that they will not leave Egypt without his bones. And with this verse we finish the Book of Bereishit. With the blessings of Hashem may we continue on to the Book of Shemos. ","ultime":"2014-06-25","dir":"mp3\/NC\/","parashah":"Vayechi","id":"398"},{"number":"1","filename":"Shemot 1.mp3","title":"Shemot 1","description":"Chp. 1 verses 1 - 8: Introduction, portion begins with the names of all the sons of Yaakov. It tells us that there were 70 souls total and that Yosef was in Egypt. That generation died. The next generation was exceedingly fruitful and the land was filled with them. A new king arose who did not know Yosef. ","ultime":"2014-07-02","dir":"mp3\/NC\/","parashah":"Shemot","id":"399"},{"number":"2","filename":"Shemot 2.mp3","title":"Shemot 2","description":"Chp. 1 verses 9 - 21: The new king of the Egyptians tries to cunningly enslave the Jewish nation. Through hard work he hopes to slow down their numbers. But Hashem has other plans the more they are oppressed the more they multiply. He tries to enlist the help of two Jewish midwives to kill the Jewish male newborns. Thinking that he would be able to kill their savior at birth. They not only do not kill the males they help in their survival. Hashem was pleased with their action and blessed them with houses. ","ultime":"2014-07-09","dir":"mp3\/NC\/","parashah":"Shemot","id":"400"},{"number":"3","filename":"Shemot 3.mp3","title":"Shemot 3","description":"Chp. 1 verse 22, Chp. 2 verses 1 - 6: Chp. 1 ends with Pharaoh commanding his people to cast all male babies into the Nile and all females would live. Chp. 2 begins with a man and a woman from the tribe of Levi marrying. She gives birth to Moshe whom she hides for three months. She then places him in cradle and puts it into the Nile. The daughter of Pharaoh goes down to the Nile and takes the basket.In it she sees a Jewish infant crying and she has compassion for him and she decides to adopt the child as her own. ","ultime":"2014-07-16","dir":"mp3\/NC\/","parashah":"Shemot","id":"401"},{"number":"0","filename":"Shemot 4.mp3","title":"Shemot 4","description":"Chp. 2 verses 7 - 14: Moshe refuses to nurse from an Egyptian woman, so Miriam suggests that she bring a Jewish woman, his mother, and Pharaoh's daughter agrees. She weans him and returns him to her. She raises him and calls him Moshe. When he gets older he goes out among his people and sees an Egyptian beating a Jew he kills the Egyptian and buries him in the sand. The next day he sees two Jewish men fighting and he rebukes them. The aggressor responds \"are you going to kill me as you did the Egyptian?\" Moshe now feared because he felt that his deed would be reported to Pharaoh.  ","ultime":"2014-07-23","dir":"mp3\/NC\/","parashah":"Shemot","id":"402"},{"number":"5","filename":"Shemot 5.mp3","title":"Shemot 5","description":"Chp. 2 verses 15 - 22: Pharaoh hears that Moshe killed the Egyptian and tries to execute him. Moshe escapes to Midian where he meets Yisro and his daughters. He marries Tziporrah and has a son whom he names Gershom. The king of Egypt dies and the Jewish people cry out to Hashem because of the severity of their bondage.  He hears their groaning and remembers them in the merit of the forefathers. ","ultime":"2014-07-30","dir":"mp3\/NC\/","parashah":"Shemot","id":"403"},{"number":"6","filename":"Shemot 6.mp3","title":"Shemot 6","description":"Chp. 3 verses 1 - 8: Moshe is out tending to the sheep of his father in law and he sees a bush burning but not consumed. He turns to inspect the spectacle. Hashem calls out to him twice from the bush and he answers. He is told to remove his shoes since the place he was at was holy. Hashem introduces Himself as the G-d of his father and the patriarchs. He is told that G-d has seen the affliction of the Jewish nation and He was ready to deliver them from the hands of the Egyptians. He would bring them to the land that flowed with milk and honey,the land of the six\/seven nations.   ","ultime":"2014-08-06","dir":"mp3\/NC\/","parashah":"Shemot","id":"404"},{"number":"7","filename":"Shemot 7.mp3","title":"Shemot 7","description":"Chp. 3 verses 9 - 18: Hashem continues to speak to Moshe. He tells him that He is now ready to take the nation out of Egypt. He tells Moshe which of His names to tell them and the special words to say that would prove to them that he was Hashem's messenger. He assures Moshe that they would believe him and that he and the elders would go before Pharaoh. They were to tell him that the G-d of the Hebrews has appeared to us and wants us to go take a three day journey out to the wilderness where will pray and bring sacrifices to Him. ","ultime":"2014-08-13","dir":"mp3\/NC\/","parashah":"Shemot","id":"405"},{"number":"8","filename":"Shemot 8.mp3","title":"Shemot 8","description":"Chp. 3 verses 19 - 22 Chp. 4 verses 1 - 9: Hashem tells Moshe that Pharaoh will not agree to let the people go until He smites him with all His wonders. Also that they would leave Egypt with gold, silver, and clothing that they would borrow from the Egyptians. Chp. 4, Moshe says to G-d that the people would not believe that Hashem had appeared to him. Then G-d gives him three signs, the snake, leprosy, and blood, to present before the people so that they would know that he was the true redeemer and the time for the redemption was now. ","ultime":"2014-08-20","dir":"mp3\/NC\/","parashah":"Shemot","id":"406"},{"number":"9","filename":"Shemot 9.mp3","title":"Shemot 9","description":"Chp. 4 verses 10 - 24: Hashem finishes speaking to Moshe, he then politely tells G-d that he has never been able to speak due to his speech impediment. G-d reminds him that speech and all other powers come from Him. Moshe still declines and Hashem gets angry and informs him that Aaron his brother is coming and he would be his spokesman. Hashem tells him to take the staff in his hand with which he would perform the signs. He says good bye to Yisro who wishes him well and he takes his wife and two children puts them on the donkey and he travels to Egypt. G-d warns him that Pharaoh would not listen to his request to let the people go and that the end would be that Hashem would kill the firstborn of Egypt. Moshe stops at an inn where an angel of G-d tries to kill him. ","ultime":"2014-08-27","dir":"mp3\/NC\/","parashah":"Shemot","id":"407"},{"number":"10","filename":"Shemot 10.mp3","title":"Shemot 10","description":"Chp.4 verses 25 - 31 Chp.5 verses 1 - 23 & Chp. 6 verse 1: Tzipporah circumcises her son and saves Moshe's life. Aaron comes to meet Moshe. They go Egypt and Aaron tells the people all that G-d had told Moshe and he shows them the signs and they believe him. Chp. 5, Moshe and Aaron go to Pharaoh and tell him that Hashem had asked that he let the people go out to the desert to serve Him. Pharaoh answers \" who is G-d that I should listen to His voice and let Israel go?\" Instead he increases the burden on the people by making them collect their own straw to make the bricks. Moshe complains to Hashem that He has dealt badly with the people, and since he came to Pharaoh things have only gotten worse. Chp. 6, Hashem tells Moshe that now you will see that Pharaoh will let them go but only with a strong hand.  ","ultime":"2014-09-03","dir":"mp3\/NC\/","parashah":"Shemot","id":"408"},{"number":"1","filename":"Va'eira 1.mp3","title":"Va'eira 1","description":"Chp. 4 verses 2 - 7: Introduction, Hashem speaks harshly to Moshe since he questioned His actions, but then softens His tone. He tells Moshe that the Avos never questioned His actions and He never had to interact with them with the name Hashem of mercy. He tells Moshe that he has heard the groans of the B'nai Yisrael because of their harsh servitude and He has remembered His covenant. He expresses to Moshe four  terms of redemption that would show the people that He was their G-d and that He would bring them out from under the burdens of the Egyptians. ","ultime":"2014-09-10","dir":"mp3\/NC\/","parashah":"Va'eira","id":"409"},{"number":"2","filename":"Va'eira 2.mp3","title":"Va'eira 2","description":"Chp. 6 verses 8 - 24: Hashem tells Moshe the fifth term of redemption, \" that I will bring you to the land.\" Moshe speaks to the people but they do not listen to him because of their harsh conditions. G-d tells him to go to Pharaoh, but Moshe says if the people don't listen to me how will Pharaoh especially with my speech defect? Hashem then tells Moshe and Aaron to speak to the people and to Pharaoh about the exodus. Portion continues with the lineage of the families of Ruevain, Shimon, and then Levi. However with Levi the Torah elucidates on their lineage, with the intent of introducing us to their families, especially Aaron his sons. ","ultime":"2014-09-17","dir":"mp3\/NC\/","parashah":"Va'eira","id":"410"},{"number":"4","filename":"Va'eira 4.mp3","title":"Va'eira 4","description":"Chp. 7 verses 8 - 22: Hashem tells Moshe that when Pharaoh asks you to do something that amazes you, tell Aaron to throw his staff in front of Pharaoh and turn it into a snake. They did what Hashem told them but Pharaoh had his magicians do the same. Then Aaron had his staff swallow all their staffs. Hashem tells Moshe to go to the Nile in the morning and warn him that G-d would turn all the water into blood and that all the fish in the Nile would die and cause Egypt to stink. Moshe told Aaron to turn all the waters into blood and he did. However, the magicians of Egypt were able to do the same with their magic and Pharaoh's heart was hardened and he didn't listen to them just as G-d had told them.","ultime":"2014-10-22","dir":"mp3\/NC\/","parashah":"Va'eira","id":"411"},{"number":"3","filename":"Va'eira 3.mp3","title":"Va'eira 3","description":"","ultime":"2012-08-01","dir":"mp3\/NC\/","parashah":"Va'eira","id":"412"}]